{"articles":[{"id":387711205411,"title":"Mind Search - a Meditation Technique","created_at":"2020-11-23T19:39:41-07:00","body_html":"\u003cp\u003eThis exercise is meant to be carried throughout a full day at least once in your individual life. Five practice periods are urged, allowing a full minute for each.\u003cbr\u003e\u003cbr\u003eIt is also a useful standalone meditative exercise that can and should be practiced when desired.\u003c\/p\u003e\n\u003cdiv\u003eThis is from the mind training practice from A Course in Miracles.\u003c\/div\u003e\n\u003cdiv\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003ca href=\"https:\/\/acim.house\/lesson-21\/\" target=\"_blank\" title=\"Acim.house lesson 21\" rel=\"noopener noreferrer\"\u003e\u003cstrong\u003eLesson 21: I am determined to see things differently.\u003c\/strong\u003e\u003c\/a\u003e\u003c\/div\u003e\n\u003cdiv\u003e\u003cstrong\u003e\u003c\/strong\u003e\u003c\/div\u003e\n\u003ch2\u003ePurpose\u003c\/h2\u003e\n\u003cp\u003eThe purpose is to bring into our awareness forms of unhappiness to which we have grown accustom or find justifiable. Our true nature is attainable when we understand that there is no cause for emotional disturbance.\u003cbr\u003e\u003cbr\u003eA secondary purpose is to simply be in rememberance that there is a different mental state, a different way of looking at the world that is attainable.\u003cbr\u003e\u003cbr\u003eA third purpose, if you are practicing the full days exercise, is to train ourselves to be in control of our faculties of attention and memory. Throughout a day, you must remember to recall your attention to the exercise.\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eExercise\u003c\/h2\u003e\n\u003cp\u003eIn the practice periods, begin by thinking the idea \"\u003cstrong\u003eI am determined to see things differently\"\u003c\/strong\u003e\u003cstrong\u003eÂ \u003c\/strong\u003eto yourself. Then close your eyes and search your mind carefully for situations past, present or anticipated, which arouse anger in you. The anger may take the form of any reaction ranging from mild irritation to rage. The degree of the emotion you experience does not matter. You will become increasingly aware that a slight twinge of annoyance is nothing but a veil drawn over intense fury.\u003cbr\u003e\u003cbr\u003eTherefore, try not to let the \"little\" thoughts of anger escape you in the practice periods. You will probably be tempted to dwell more on some situations than on others on the fallacious grounds that they are more \"obvious.\" This is not so. It is merely an example of the belief that some forms of misunderstanding are more justified than others.\u003cbr\u003e\u003cbr\u003eRemember that you do not really recognize what arouses anger in you, and nothing that you believe in this connection means anything. It is your perception that is causing unease. Perceptions can be changed.\u003c\/p\u003e\n\u003cdiv style=\"text-align: center; margin: 50px 0;\"\u003e\n\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/20201123_195745_0000_240x240.png?v=1606184753\" alt=\"Fighting\" style=\"float: none;\" width=\"240x240\" height=\"240x240\"\u003e\n\u003cp style=\"text-align: center; font-size: .9em; color: #777;\"\u003e\u003cbr\u003eYou are normally focused at this level.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cdiv style=\"text-align: center; margin: 50px 0;\"\u003e\n\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/20201123_201927_240x240.png?v=1606184883\" alt=\"Observe fighting\" style=\"float: none;\"\u003e\n\u003cdiv style=\"text-align: center; font-size: .9em; color: #777;\"\u003eThe purpose of this exercise is to draw your focus to this level.\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003eAs you search your mind for all the forms in which thoughts of anger present themselves, hold each one in mind and tell yourself:\u003cbr\u003e\u003cbr\u003eI am determined to see [name_of_person] differently.\u003cbr\u003eI am determined to see [specific_situation] differently.\u003cbr\u003e\u003cbr\u003eTry to be as specific as possible. You may, for example, focus your anger on a particular attribute of a particular person. If your perception of the person is suffering from this form of distortion, say:\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\n\u003cbr\u003eI am determined to see [name_of_person]'s [specific_attribute] differently.\u003cbr\u003e\u003cbr\u003eExamples:\u003cbr\u003e\u003cbr\u003e\u003cem\u003eI am determined to see my step-mother differently.\u003c\/em\u003e\u003cbr\u003e\u003cbr\u003e\u003cem\u003eI am determined to see my recent job loss differently.\u003c\/em\u003e\u003cbr\u003e\u003cbr\u003e\u003cem\u003eI am determined to see Felicia's unwillingness to stay in contact differently.\u003c\/em\u003e\n\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003chr\u003e\n\u003cdiv style=\"text-align: left;\"\u003ePractice once now. Take about 1 minute and work through the exercise.\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003ca href=\"https:\/\/www.google.com\/search?safe=active\u0026amp;q=1+minute+timer\" target=\"_blank\" title=\"Timer\" rel=\"noopener noreferrer\"\u003eClick here for a timer\u003c\/a\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003chr\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003eMore important than the specific steps of this exercise are the understandings you gain from your willingness to see differently.\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003eAre you? Or do you enjoy seeing emotional pain? Your choice.\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003eStay blessed.\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e- alex brady\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003c\/div\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-11-23T19:57:43-07:00","updated_at":"2020-11-23T20:06:25-07:00","summary_html":"\u003cp\u003eA meditation exercise to search out and correct mental disturbances.\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThe purpose is to bring into our awareness forms of unhappiness to which we have grown accustom or find justifiable. Our true nature is attainable when we understand that there is no cause for emotional disturbance.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eAre you determined to see things differently?\u003c\/span\u003e\u003c\/p\u003e","template_suffix":"","handle":"mind-search-a-meditation-technique","tags":"meditation technique","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387711205411"},{"id":387680534563,"title":"Mind Identity","created_at":"2020-11-13T09:15:24-07:00","body_html":"\u003cp\u003eI've been kicking around the idea from A Course in Miracles regarding the concept of identity.\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp class=\"text\"\u003eI am mind. I am spirit. I am not a body. I am free. I am as God created me.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eI've gathered some of my thoughts \u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/Identity_v2.pdf?v=1605626169\" target=\"_blank\" title=\"Mind identity pdf\" rel=\"noopener noreferrer\"\u003ein this powerpoint:Â Â https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/Identity_v2.pdf?v=1605626169\u003c\/a\u003e This is not the finished product, but it's what I have now.\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eNote:\u003c\/strong\u003e I have extracted most religious terminology away from the ideas as presented in the Course (Father, Son, you know the story..). The \u003cem\u003estory\u003c\/em\u003e that is used to convey understsndings in the Course becomes a useful learning device eventually, but it is not necessary for foundational and practical identity principles.\u003c\/p\u003e\n\u003cp\u003eA more finished product can only be enhance by other's insights, so if you read this and have strong ideas or feelings leave a comment or contact me:Â  iamalexbrady@gmail.com.\u003c\/p\u003e\n\u003cp\u003ephilosophy-club.mn.co\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-11-13T09:25:40-07:00","updated_at":"2020-11-17T08:18:02-07:00","summary_html":"\u003cp\u003eI've been kicking around the idea from A Course in Miracles regarding the concept of identity.\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp class=\"text\"\u003eI am mind. I am spirit. I am not a body. I am free. I am as God created me.\u003c\/p\u003e\n\u003cp class=\"text\"\u003eInsights gathered into a pdf presentation.Â \u003c\/p\u003e\n\u003c\/div\u003e","template_suffix":"","handle":"mind-identity","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387680534563"},{"id":387668181027,"title":"How to Straighten Out Your Mind","created_at":"2020-11-09T08:23:28-07:00","body_html":"\u003cp\u003eA Course in Miracles, Chapter 30 - Rules for Decision:\u003c\/p\u003e\n\u003cp\u003eBut there will still be times when you have judged already. Now the answer will provoke attack \u003cstrong\u003e\u003cem\u003eunless\u003c\/em\u003e you quickly straighten out your mind\u003c\/strong\u003e to \u003cem\u003ewant\u003c\/em\u003e an answer that will work. Be certain this has happened if you feel yourself unwilling to sit by and ask to have the answer given you.\u003c\/p\u003e\n\u003cp\u003eIf you want peace of mind, follow these steps or admit that you don't want peace of mind. Or don't admit it, but understand that lying to yourself is a symptom of the desire for lack of peace. Or \"don't understand it\", but do because you're not an idiot.\u003c\/p\u003e\n\u003cp\u003eFollow these steps for peace:\u003c\/p\u003e\n\u003cp\u003e1. Ask yourself: \"What is going on?\"\u003c\/p\u003e\n\u003cp\u003e2. Decide that you don't like your feelings\/mood.\u003c\/p\u003e\n\u003cp\u003e3.Â \u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":null,"updated_at":"2020-11-09T08:23:28-07:00","summary_html":"","template_suffix":"","handle":"how-to-straighten-out-your-mind","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387668181027"},{"id":387619880995,"title":"Gain New Understandings by Listening","created_at":"2020-10-27T01:31:11-06:00","body_html":"\u003cp\u003eThe usual case for me is that the understandings for workbook lessons come in waves throughout the day.Â Here is progression of understandings regarding Lesson 275: \"God's healing Voice protects all things today.\"\u003c\/p\u003e\n\u003ch2 class=\"quote\"\u003ePart One\u003c\/h2\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\n\u003cdiv class=\"quote\"\u003eLet us today attend the Voice of God, Which speaks an ancient lesson, no more true today than any other day. Yet has this day been chosen as the time when we will seek and hear and learn and understand. Join me in hearing. For the Voice of God tells us of things we cannot understand alone, nor learn apart. It is in this that all things are protected. And in this the healing of the Voice of God is found.\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cp class=\"first-line-indent\"\u003eFirst time I read this, I was confused. No bars held. Barely remembered the title.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003eKnowing a workbook lesson is meant to be understood, I came back to it a few hours later. This time reading thought, I was confused specifically about what could need protection? If \"nothing real can be threatened\", what would need protective efforts of the Voice of God? This time I focused on the two sentences\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cdiv class=\"course\"\u003e\n\u003cp\u003e\"For the Voice of God tells us of things we cannot understand alone, nor learn apart. It is in this that all things are protected.\"\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cp\u003eThen an understanding of these sentences clicked: all real things, truthful ideas and understandings, are protected from our misunderstandings because the Voice for God remembers and will give them to us. A synonym for \"protected\" in this case is \"safely-kept\". Not guarded defensively as I originally thought.\u003c\/p\u003e\n\u003cp\u003eLater, I came to it again. This time I had the additional Idea that the \"all things\" were the truths that we have forgotten. I focused on the next sentence:\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cdiv class=\"course\"\u003e\n\u003cp\u003eFor the Voice of God tells us of things we cannot understand alone, nor learn apart. ... And in this the healing of the Voice of God is found.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cp\u003eBy gaining the understandings provided by the Voice for God, our understandings of our identity and essence is more complete. We understand more the primacy of mind over form, and the worries of form fall away.\u003c\/p\u003e\n\u003cp\u003eHealing in these contexts mean 1) to complete and 2) to make healthy respectively. As we recognize our mind identity (complete our understanding of our higher Self), our experiences in the physical will reflect the new understandings (heal).\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003ePart two\u003c\/h2\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cdiv class=\"course\"\u003e\n\u003cp\u003eYour healing Voice protects all things today, and so I leave all things to You. I need be anxious over nothing. For Your Voice will tell me what to do and where to go, to whom to speak, and what to say to him, what thoughts to think, what words to give the world. The safety that I bring is given me. Father, Your Voice protects all things through me.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cp\u003eThis paragraph is loaded ðŸ’£.\u003c\/p\u003e\n\u003cp\u003eGiven what I understood from the first paragraph, this one seems to be suggesting leaving all concerns to be handled by the Voice for God ,*through* us. As in literally allow in the moment actions to be guided by the Spirit.\u003c\/p\u003e\n\u003cp\u003eChapter 30 teaches that all behaviors are guided by one belief system or the other, so this suggestion to always choose the one guided by God can be considered the most reasonable decision.\u003c\/p\u003e\n\u003cp\u003eIs it though? What has been you experience with receiving guidance from this spirit?\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-29T18:37:59-06:00","updated_at":"2020-10-29T18:38:44-06:00","summary_html":"\u003cp\u003eA progression of understandings about the nature of \"all things\" via ACIM workbook lesson 275: \"God's healing Voice protects all things today.\"\u003c\/p\u003e\n\u003cp\u003eHow does this lesson help you understand \"all things\"?\u003c\/p\u003e","template_suffix":"","handle":"gain-new-understandings-by-listening","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387619880995","image":{"created_at":"2020-10-29T18:37:59-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_453b72c3-4357-4989-91df-265432f765d6.png?v=1604018279"}},{"id":387598876707,"title":"ACIM: \"What is the Body?\" a Highlight","created_at":"2020-10-21T15:11:12-06:00","body_html":"\u003cp\u003eFrom the \u003ca href=\"https:\/\/acim.house\/lesson-261-i\/\" target=\"_blank\" title=\"what is the body acim house\" rel=\"noopener noreferrer\"\u003e\"What is the Body?\"\u003c\/a\u003e workbook special topic:\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp class=\"text\"\u003eThe body is a fence the Son of God imagines he has built, to separate parts of his Self from other parts. It is within this fence he thinks he lives, to die as it decays and crumbles. For within this fence he thinks that he is safe from love. Identifying with his safety, he regards himself as what his safety is. How else could he be certain he remains within the body, keeping love outside?\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eAnd if you're anything like me, I know what you're thinking:\u003c\/p\u003e\n\u003cdiv style=\"margin: 3em auto; border: 1px solid black; width: 50%; text-align: center; padding: 5%;\"\u003e\u003cspan\u003eWhat. The. Fuck.\u003cbr\u003eDoes. This. Mean. ?.\u003c\/span\u003e\u003c\/div\u003e\n\u003cp\u003eThe first sentence about being a fence, I can wrap my head around.Â GivenÂ One Self that appears to be in separate parts, I can see visually and mentally how the form of bodies is the symbol of separation. It can be as if each body is a different fencing in and separating off.\u003c\/p\u003e\n\u003cdiv style=\"text-align: start;\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/from_one_many_notated_480x480.png?v=1603315403\" alt=\"many come from one, an illustration\" style=\"margin: 50px 27.2px 50px 27.2px; float: none;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: start;\"\u003e\u003c\/div\u003e\n\u003cp\u003eIn the illustration provided, there can be seen 3 separate red bodiesÂ brought into existence by shading over their connectedness with darkness.\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003eThe part that took (is taking) me longer to wrap my head around is what definition of love is being used here.\u003c\/p\u003e\n\u003cp\u003eMy first working definition is \"Love is completion\". Hence why the body decays and crumbles; it is the opposite of completion -- by definition incompletion, always incomplete. If the fence is maintained, a \"part\" of the Son of God will never be complete because it is by definition aÂ \u003cspan style=\"text-decoration: underline;\"\u003epart\u003c\/span\u003e, \"safe from completion\"\u003cem\u003e.\u003c\/em\u003eÂ \u003c\/p\u003e\n\u003cp\u003eApparently, the purpose of \"fencing\" off into separate parts was to experience this incompletion, this separation.\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp\u003e\"For within this fence he thinks that he is safe from love.\"\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eThis sounds insane, but this is theÂ \u003cem\u003epoint\u003c\/em\u003e of the exercise. One separatesÂ \u003cem\u003eto beÂ separate\u003c\/em\u003e; that's why. It is trying to avoid completion. In order to maintain this idea that instead of being one whole, it is many parts, this self must identify with each part individually. That's the only way the exercise works.\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp\u003e\u003cspan\u003e\"How else could he be certain he remains within the body, keeping love outside?\"\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003chr\u003e\n\u003cp\u003eThere are four more paragraphs in this special topic. I have been able toÂ understand the passages with the following definitions of \"love\":\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eLove is completion\u003c\/li\u003e\n\u003cli\u003eLove is unity\u003c\/li\u003e\n\u003cli\u003eLove is loving emotions (good feelings)\u003c\/li\u003e\n\u003cli\u003eLove is understanding (the essence of)\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eCan you read the passage with the different definitions and capture new understandings?\u003c\/p\u003e\n\u003cp\u003eHave fun.\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/acim.house\/lesson-261-i\/\" target=\"_blank\" title=\"what is the body acim house\" rel=\"noopener noreferrer\"\u003e[Full Text]\u003c\/a\u003eÂ (link to acim.house)\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e-alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-21T15:11:11-06:00","updated_at":"2020-10-25T22:24:50-06:00","summary_html":"\u003cdiv class=\"course-quote\"\u003e\n\u003cp class=\"text\"\u003eACIM: \"For within this fence he thinks that he is safe from love. Identifying with his safety, he regards himself as what his safety is. How else could he be certain he remains within the body, keeping love outside?\"Â \u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eAnd if you're anything like me, I know what you're thinking: \"...what? \u003cspan\u003eðŸ¤”\u003c\/span\u003e\"Â \u003c\/p\u003e\n\u003cp\u003eCaptured understandings inside.\u003c\/p\u003e","template_suffix":"","handle":"acim-what-is-the-body-a-highlight","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387598876707","image":{"created_at":"2020-10-21T15:11:12-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_50f9c8fb-d2f8-4722-84d7-4cbb993c2cba.png?v=1603314672"}},{"id":387597074467,"title":"Stay Hydrated | Yogananda","created_at":"2020-10-21T00:42:43-06:00","body_html":"\u003ch3\u003eQuench your thirst with divine ecstasy.\u003c\/h3\u003e\n\u003cdiv style=\"text-align: justify; width: 80%; margin: 0 auto;\"\u003e\n\u003cp\u003e\u003cspan\u003eWhen the scriptural philosopher dissects words and thoughts with the scalpel of his reason, he may grow so fond of theoretical knowledge and of mentally separating wisdom into various segments that he may \"dry up\" through lack of the experience of truth in divine ecstasy. If a person spent his lifetime in analyzing the properties of water and in examining water from different sources all over the world, he would not thereby quench his thirst. A thirsty man, without fussing over the atomic constituencies, selects some good water; drinking it, he becomes satisfied.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eA theoretical knowledge of scriptures often produces a conviction that one knows the truth when he actually does not know it. Only by communing with God, the \"Library of All Knowledge,\" may one know all truths in their exactitude, without wasting time in the theoretical understanding and misunderstanding of scriptures. That is why a wide gulf may exist between scripture readers and men of realization who are themselves embodiments of scriptural truths. The Pharisees were willing to crucify Christ because they surmised fearfully that he was a threat to their authority, having actually perceived the truths that they knew only in theory.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003eParamahansa 'a.b' Yogananda\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/yoga_ab_nanda_240x240.png?v=1603264081\" alt=\"yogananda dressed as a.b\" width=\"240x240\" height=\"240x240\" style=\"margin-top: 20px; margin-bottom: 20px; float: none;\"\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan\u003eCurrently making my way through this site, it's pretty good. Probably doing exactly what it's guiding away from, but hey, it's a process.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eRead more: http:\/\/yogananda.com.au\/gita\/gita0646-1.html\u003c\/span\u003e\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eDon't \"Dry Up\"\u003c\/h2\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/collections\/all\" target=\"_blank\" title=\"alex brady store\" rel=\"noopener noreferrer\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/stay_hydrated_shop_now_ad_2x1_7ae4296e-2282-44b9-a458-d8222cc98d4a_480x480.png?v=1603263078\" alt=\"stay hydrated show now\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eStay Hydrated\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-21T00:42:42-06:00","updated_at":"2020-10-21T01:59:30-06:00","summary_html":"\u003ch3\u003eQuench your thirst with divine ecstasy.\u003c\/h3\u003e\n\u003cp\u003e\u003cspan\u003e\"When the scriptural philosopher dissects words and thoughts with the scalpel of his reason, he may grow so fond of theoretical knowledge that he may \"dry up\" through lack of the experience of truth in divine ecstasy.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eShort quote and wisdom fromÂ Paramahansa Yogananda.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eStay hydrated.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":"","handle":"stay-hydrated-yogananda","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387597074467","image":{"created_at":"2020-10-21T00:42:43-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_80d49b61-1918-402e-bcec-4a4ab21a3dbf.png?v=1603262563"}},{"id":387591471139,"title":"Get Good at Meditation","created_at":"2020-10-20T10:04:09-06:00","body_html":"\u003cp\u003eMeditation\u003c\/p\u003e\n\u003cp\u003eThese are two google definitions --\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/www.google.com\/search?q=meditation+definition+spirituality\" target=\"_blank\" title=\"meditation definition spirituality\" rel=\"noopener noreferrer\"\u003eSpiritual meditation\u003c\/a\u003e -Â Spiritual meditation is an experience that takes you to the depths of who you are. You, as your real self, stripped of all the perceptions you had about yourself until that point in your life. In the process, you experience joy and peace. A feeling of love and light warms up your being.\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/www.google.com\/search?q=meditation+definition+psychology\" target=\"_blank\" title=\"meditation definition psychology\" rel=\"noopener noreferrer\"\u003ePsychological meditation\u003c\/a\u003e --Â Meditation can be defined as a set of techniques that are intended to encourage a heightened state of awareness and focused attention. Meditation is also a consciousness-changing technique that has been shown to have a wide number of benefits on psychological well-being.\u003c\/p\u003e\n\u003cp\u003eHere is alex brady's defintion\u003c\/p\u003e\n\u003cp\u003eMeditation -- Shut up practice. Tell the voices in head, mental perturbations to shut up. These faculties don't mind well, but you get better at willing them quiet.\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":null,"updated_at":"2020-10-20T10:04:09-06:00","summary_html":"","template_suffix":"","handle":"get-good-at-meditation","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387591471139"},{"id":387587997731,"title":"Why A Course in Miracles is Great 1","created_at":"2020-10-19T15:00:53-06:00","body_html":"\u003cp\u003eHey, reader.\u003c\/p\u003e\n\u003cp\u003eI am alex brady and this is why A Course in Miracles is great.\u003c\/p\u003e\n\u003col class=\"description-list\"\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eIt teaches the learner how to do miracles.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eIf you wanted to learn calculus, you would take a course in calculus.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eIt's 100% self-guided and egalitarian. No weird positions of power. (unless that's something you're aboutÂ \u003cspan\u003e( Í¡Â° ÍœÊ– Í¡Â°))\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eFeel free to join the club and share your newly acquired understandings. Share your light.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eThe teachings make you feel more happy without prescribing morality.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eThis is a course on how to acquire a peaceful state of mind. One of joy, honesty, and freedom.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eAre you happy right now or not?Â Would you like a path out?\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eadf\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eadf\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eadf\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eadf\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":null,"updated_at":"2020-10-19T15:00:53-06:00","summary_html":"","template_suffix":"","handle":"why-a-course-in-miracles-is-great-1","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387587997731"},{"id":387577970723,"title":"jesus = Christ.new","created_at":"2020-10-16T14:14:34-06:00","body_html":"\u003ch2\u003eWhat it seems like:\u003c\/h2\u003e\n\u003c!-- HTML generated using hilite.me --\u003e\n\u003cdiv style=\"background: #ffffff; overflow: auto; width: auto; border: solid gray; border-width: .1em .1em .1em .8em; padding: .2em .6em; margin: 3em auto;\"\u003e\n\u003cpre style=\"margin: 0; line-height: 125%;\"\u003e\u003cspan style=\"font-weight: bold;\"\u003eclass\u003c\/span\u003e \u003cspan style=\"font-weight: bold;\"\u003eChrist\u003c\/span\u003e \u0026lt; God\n\n  \u003cspan style=\"font-weight: bold;\"\u003eattr_accessor\u003c\/span\u003e \u003cspan style=\"font-style: italic;\"\u003e:is_awake\u003c\/span\u003e\n\n  \u003cspan style=\"font-weight: bold;\"\u003edef\u003c\/span\u003e sleep\n    @is_awake = \u003cspan style=\"font-weight: bold;\"\u003efalse\u003c\/span\u003e\n  \u003cspan style=\"font-weight: bold;\"\u003eend\u003c\/span\u003e\n\n  \u003cspan style=\"font-weight: bold;\"\u003edef\u003c\/span\u003e awaken\n    @is_awake = \u003cspan style=\"font-weight: bold;\" mce-data-marked=\"1\"\u003etrue\u003c\/span\u003e\n  \u003cspan style=\"font-weight: bold;\"\u003eend\u003c\/span\u003e\n\n\u003cspan style=\"font-weight: bold;\"\u003eend\u003c\/span\u003e\n\u003c\/pre\u003e\n\u003c\/div\u003e\n\u003c!-- HTML generated using hilite.me --\u003e\n\u003cdiv style=\"background: #ffffff; overflow: auto; width: auto; border: solid gray; border-width: .1em .1em .1em .8em; padding: .2em .6em; margin: 3em auto;\"\u003e\n\u003cpre style=\"margin: 0; line-height: 125%;\"\u003echrist.sleep\nchrist.awaken \u003cspan style=\"font-style: italic;\"\u003e# \u0026lt;== exec began 0 AD\u003c\/span\u003e\nparty\n\u003c\/pre\u003e\n\u003c\/div\u003e\n\u003ch2\u003eAt some level we're the dev that ran this line:\u003c\/h2\u003e\n\u003c!-- HTML generated using hilite.me --\u003e\n\u003cdiv style=\"background: #ffffff; overflow: auto; width: auto; border: solid gray; border-width: .1em .1em .1em .8em; padding: .2em .6em; margin: 3em auto;\"\u003e\n\u003cpre style=\"margin: 0; line-height: 125%;\"\u003e$ ruby separation.rb\n\u003c\/pre\u003e\n\u003c\/div\u003e\n\u003chr\u003eand i think about that sometimes... - alexbrady","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-16T14:14:33-06:00","updated_at":"2020-10-16T14:14:34-06:00","summary_html":"\u003cdiv style=\"background: #ffffff; overflow: auto; width: auto; border: solid gray; border-width: .1em .1em .1em .8em; padding: .2em .6em;\"\u003e\n\u003cpre style=\"margin: 0; line-height: 125%;\"\u003echrist.sleep\nchrist.awaken \u003cspan style=\"font-style: italic;\"\u003e# \u0026lt;== exec began 0 AD\u003c\/span\u003e\nparty\n\u003c\/pre\u003e\n\u003c\/div\u003e","template_suffix":"","handle":"jesus-christ-new","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387577970723","image":{"created_at":"2020-10-16T14:14:34-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_a5acd4ce-76dc-470c-b9b4-0bdea0346d16.png?v=1602879274"}},{"id":387573645347,"title":"Game: 20 Questions","created_at":"2020-10-15T19:07:20-06:00","body_html":"\u003cdiv class=\"_19iAGNPVtW4H4cmtpESqQs uaJN7fdQ7gwgTpZ7jtgcz\"\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eTime goes by easier when you're having fun. A little game for passing the time.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eOne person has an idea in mind. Can you figure it out in 20 questions?\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eThis game is great mental practice of open-mindedness, imagination, and critical thinking.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003ePerfect for small groups. No materials needed.\u003c\/span\u003e\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003ehouse rules\u003c\/p\u003e\n\u003chr\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003e\u003cstrong\u003eSetup\u003c\/strong\u003e\u003c\/span\u003e\u003c\/h3\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eNumber of players needed:\u003c\/strong\u003e\u003cspan\u003eÂ 2 - 7-ish\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eTime required:\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003eHowever long you want\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eMaterials needed:\u003c\/strong\u003e\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eNone\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"_19iAGNPVtW4H4cmtpESqQs uaJN7fdQ7gwgTpZ7jtgcz\"\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eHow To Play\u003c\/span\u003e\u003c\/h3\u003e\n\u003col class=\"description-list\"\u003e\n\u003cli\u003eOne person is the Answerer. All others are Askers.\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Answerer declares they are thinking of a thing from one of the possibleÂ \u003cstrong\u003ecategories\u003c\/strong\u003e. (list below)\u003c\/p\u003e\n\u003cp class=\"example\"\u003eI am thinking of a non-living thing.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Askers ask the Answerer a yes-or-no question.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eThis can be a question about the thing, \"Is it larger than a microwave?\" . It can be an outright guess at the thing, \"Is it a microwave?\".\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003eThe Answerer replies truthfully yes or no.\u003c\/li\u003e\n\u003cli\u003eThe Answerer increments the question count.\u003c\/li\u003e\n\u003cli\u003eSteps 3 - 5 repeat until the Asker guesses correctly or the question count is 20.\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003eIf the question count is 20, the Asker gets one final chance to guess the thing.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eIs it a microwave?\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhen the question count is 6, 12, and 18, the Answerer gives a hint of their choosing. It must be a fact about the thing.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eThis thing can be purchased at Walmart.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eRules for the Answerer\u003c\/span\u003e\u003c\/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003eThe thing should not change mid-game.\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003e\u003cspan\u003eThe Answerer is tasked with the question count, the number of questions that have been asked.\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003eAll questions that count must come from the Askers of the game.\u003c\/li\u003e\n\u003cli\u003eIt does not matter which Asker asks, it's the question that you answer that counts.\u003c\/li\u003e\n\u003cli\u003eHints given after questions 6, 12, and 18 can be as helpful as you want.\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eRules for the Askers\u003c\/span\u003e\u003c\/h3\u003e\n\u003cul class=\"description-list\"\u003e\n\u003cli\u003eWork together to figure out what the Answerer's thing is.\u003c\/li\u003e\n\u003cli\u003eDepending on the other goings-on of the day, take as long or little as you like deliberating before asking a question.\u003c\/li\u003e\n\u003cli\u003eAskersÂ do not have to be in agreementÂ on what questionsÂ are received andÂ answered.\u003c\/li\u003e\n\u003cli\u003eQuestion 21 must be in the form of a guess at the identity of the thing.\n\u003cp class=\"example\"\u003eIs it a lollipop?\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003e\u003cspan\u003eCategories\u003c\/span\u003e\u003c\/h3\u003e\n\u003cul class=\"description-list\"\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eNon-living thing\u003c\/p\u003e\n\u003cp class=\"example\"\u003eglasses, soap, fingernails (most frequent category)\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eLiving thing\u003c\/p\u003e\n\u003cp class=\"example\"\u003eoctopus, daisy (easiest category)\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003ePerson\u003c\/p\u003e\n\u003cp class=\"example\"\u003eGeorge Washington, Mickey Mouse, Paul Bunyan, a shared associate (any personification, get creative)\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eConcept\u003c\/p\u003e\n\u003cp class=\"example\"\u003ethe speed of light, honor, magic (best for seasoned players)\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-15T19:07:20-06:00","updated_at":"2020-10-16T14:24:02-06:00","summary_html":"\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003cspan\u003eOne person has an idea in mind. Can you figure it out in 20 questions?\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eThis game is great mental practice of open-mindedness, imagination, and critical thinking.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan mce-data-marked=\"1\"\u003ealex brady house rules. 2+ required.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":"","handle":"game-20-questions","tags":"game","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387573645347","image":{"created_at":"2020-10-15T19:10:04-06:00","alt":"","width":1250,"height":1262,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_games_logo_da81b5b0-c3de-44ca-b74b-425cb6a9fc09.png?v=1602810605"}},{"id":387569254435,"title":"Darkness: A Comic","created_at":"2020-10-15T02:30:46-06:00","body_html":"\u003cdiv style=\"text-align: left;\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/darkness_2048x2048.png?v=1602750518\" alt=\"darkness: a comic. the light has come\" style=\"float: none;\"\u003e\u003c\/div\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-15T02:30:51-06:00","updated_at":"2020-10-15T02:30:51-06:00","summary_html":"First there was light. Then darkness fell. There's more to the story. A comic perspective.","template_suffix":"","handle":"darkness-a-comic","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387569254435","image":{"created_at":"2020-10-15T02:30:46-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_face2e94-d8c8-4f97-964f-a39820b3ab19.png?v=1602750647"}},{"id":387562962979,"title":"Progression of Belief","created_at":"2020-10-13T17:49:53-06:00","body_html":"\u003cp\u003eFound this cool progression while reading \u003cem\u003eA Course in Miracles\u003c\/em\u003e Lesson 284:\u003cstrong\u003e I can elect to change all thoughts that hurt.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cdiv class=\"course-quote\"\u003e\n\u003cp class=\"text\"\u003eLoss is not loss when properly perceived. Pain is impossible. There is no grief with any cause at all. And suffering of any kind is nothing but a dream.\u003c\/p\u003e\n\u003cp class=\"text\"\u003eThis is the truth, at first to be but said and then repeated many times; and next to be accepted as but partly true, with many reservations. Then to be considered seriously more and more, and finally accepted as the truth. I can elect to change all thoughts that hurt. And I would go beyond these words today, and past all reservations, and arrive at full acceptance of the truth in them.\u003c\/p\u003e\n\u003cp class=\"citation\"\u003e\u003cem\u003eA Course in Miracles\u003c\/em\u003e, Lesson 284\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eHere is the progression I've extracted. This is can be applied to any \"radical truth\" from\u003cem\u003e A Course in Miracles\u003c\/em\u003e, not just the idea that pain is impossible. In fact, if you think there are degrees to miracles, you may want to start smaller. \u003cspan style=\"color: #ffffff;\"\u003e(yes i see what i did there)\u003c\/span\u003e\u003c\/p\u003e\n\u003ch2\u003eThe Phases\u003c\/h2\u003e\n\u003cp\u003eFor a given radical truth you attempt to learn, you move through these phases:\u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003eRepeat it to yourself. Repeat it to yourself.\u003c\/li\u003e\n\u003cli\u003eAccept it as partly true with reservations.\u003c\/li\u003e\n\u003cli\u003eConsiderÂ it seriously more and more.\u003c\/li\u003e\n\u003cli\u003eAccept as truth.\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cdiv class=\"image-box\"\u003e\n\u003ca href=\"https:\/\/www.reddit.com\/r\/ACIM\/comments\/j8k0n7\/acim_workbook_lesson_284i_can_elect_to_change_all\/\" target=\"_blank\" title=\"link to post\" rel=\"noopener noreferrer\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/lesson_284_progression_480x480.png?v=1602628526\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/a\u003e\n\u003cp class=\"citation\"\u003eWhat phase are you on? r\/acim discussion\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eI asked around Reddit to see where they stood in the progression. The only two answers are atÂ PhaseÂ 1.\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003eLet's get toÂ PhaseÂ 4 individually and collectively. Individually on collectively as many truths as possible. (You only need one.)\u003c\/p\u003e\n\u003cp\u003eHow?\u003c\/p\u003e\n\u003ch2\u003eThe Steps:\u003c\/h2\u003e\n\u003col class=\"description-list\"\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eRepeat it until it works once.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eAnd you believe it works. Be aware that you are using the words to increase a peaceful mind. Be honest whether the effect was achieved.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eexample: \"I could see peace instead of this\" successfully reminds you to reduce feelings of impatience while waiting in a line\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eRepeat it in the area where it worked once. Generalize it to other areas.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eOnce it happens once, be glad that you have a useful tool to dispel stress. Use it as soon as you remember when stress and unease arise.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eRepeat \"I could see peace instead of this\"Â to reduce impatience with coworkers.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eRepeat \"I could see peace instead of this\" to reduceÂ stress with a flat tire.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eRepeat \"I could see peace of this\" to reduce stress during an argument.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eHabitually repeat the words of truth in response to applicable discomforting stimuli.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eAfter the idea has been generalized, it becomes a highly prized thought, readily at the forefront. It will be habitual to apply it to applicable situations.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eAt the moment you notice any upset, you remember you could see peace instead. This brings you peace more often than not.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp class=\"main-point\"\u003eYou understand that it works.\u003c\/p\u003e\n\u003cp class=\"additional\"\u003eYou believe the thought system so well that you live in a state that the once \"radical truth\" dispels thoughts of lack of peace before you have a chance to become invested.\u003c\/p\u003e\n\u003cp class=\"example\"\u003eexample:Â There is nothing to see peace \"instead\" of. You see peace.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003chr\u003e\n\u003cp\u003eIn a.b shorthand -- do it again until it works. A simple algorithm for learning anything if you really think about it.\u003c\/p\u003e\n\u003cp\u003eI can attest that this was my personal progression with the truth \"I choose the joy of God instead of pain.\" I'm somewhere around Phase 2\/3 at the time of this posting. Still wouldn't want to stub my toe though.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cstyle\u003e\u003c!--\n\n--\u003e\u003c\/style\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-13T17:49:53-06:00","updated_at":"2020-10-13T17:57:25-06:00","summary_html":"\u003cp\u003eFor a given radical truth you attempt to learn, you move through these phases:\u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003eRepeat it to yourself. Repeat it to yourself.\u003c\/li\u003e\n\u003cli\u003eAccept it as partly true with reservations.\u003c\/li\u003e\n\u003cli\u003eConsiderÂ it seriously more and more.\u003c\/li\u003e\n\u003cli\u003eAccept as truth.\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003eLearn a method of going through those phases inside.\u003c\/p\u003e","template_suffix":"","handle":"progression-of-belief","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387562962979","image":{"created_at":"2020-10-13T17:49:53-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_1e7abc49-8e72-4398-ba1e-623d05924245.png?v=1602632994"}},{"id":387549102115,"title":"You are not what you think you are.","created_at":"2020-10-09T15:26:22-06:00","body_html":"\u003ch2\u003eWhat I think I am\u003c\/h2\u003e\n\u003cp\u003eI think I amÂ a human being on planet Earth.\u003c\/p\u003e\n\u003cp\u003eI think my life has a beginning, middle, and end.\u003c\/p\u003e\n\u003cp\u003eI think the global economy is important.\u003c\/p\u003e\n\u003cp\u003eI thinkÂ myÂ personal economy is especially important.\u003c\/p\u003e\n\u003cp\u003eThere are many things about me personally that are important.\u003c\/p\u003e\n\u003cp\u003eÂ \u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/i_am_not_a_body_blog_240x240.png?v=1602267535\" alt=\"i am not a body i am free lesson 199\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/p\u003e\n\u003cp\u003eI think IÂ am a body and its stories are important.\u003c\/p\u003e\n\u003cp\u003eI amÂ not a body. Its stories are only as important as IÂ have them be.\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eI am not a body. What am I?\u003c\/h2\u003e\n\u003cp\u003eIt is up toÂ you to find the answer.\u003c\/p\u003e\n\u003cstyle\u003e\u003c!--\n.margin-box, .text-quote { margin: 2em 0; }\n.text-quote .quote { text-align: justify; width: 80%; margin: auto; font-weight: bold; }\n.text-quote .attribution { text-align: center; color: #555; font-size: .8em; margin-top: .2em; }\n--\u003e\u003c\/style\u003e\n\u003cdiv class=\"text-quote\"\u003e\n\u003cdiv class=\"quote\"\u003eWhat you think you are is a belief to be undone. But what you really are must be revealed to you. The belief you are a body calls for correction, being a mistake. The truth of what you are calls on the strength in you to bring to your awareness what the mistake conceals.\u003c\/div\u003e\n\u003cdiv class=\"attribution\"\u003eA Course in Miracles, Lesson 91\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cp\u003eWhat my mistake concealed:\u003c\/p\u003e\n\u003cp\u003eI amÂ a master creator creating an experience for myself wherein I forgetÂ my identity. The goal is to remember what I am.\u003c\/p\u003e\n\u003cp\u003eIt's an illusion. It's a dream. It's a game.\u003c\/p\u003e\n\u003cp\u003eOnceÂ I realize the depth and scale of this statement,Â I become the creator. I become the illusionist, the dreamer, the gamemaster. I gain control.\u003c\/p\u003e\n\u003cp\u003eBut not the who I thought I was before.\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003eÂ \u003c\/p\u003e\n\u003cdiv class=\"margin-box\"\u003e\n\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/my_self_is_ruler_blog_240x240.png?v=1602266396\" alt=\"what does this mean my self is ruler of the universe\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp style=\"text-align: center; color: #555; font-size: .8em; margin-top: -1em;\"\u003eOnly if I think I amÂ this Who.\u003c\/p\u003e\n\u003c\/div\u003e\n\u003chr\u003e\n\u003cp\u003eWhen you're ready to rule the universe, come find alexbrady.\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eAlso get this hat:\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/products\/christ-is-risen-flat-bill\" target=\"_blank\" title=\"christ is risen flatbill\" rel=\"noopener noreferrer\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/christ_is_risen_ad_480x480.png?v=1602280302\" alt=\"\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/a\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-09T15:26:22-06:00","updated_at":"2020-10-09T15:54:01-06:00","summary_html":"\u003cp\u003eI think I amÂ a human being on planet Earth.\u003c\/p\u003e\n\u003cp\u003eI think my life has a beginning, middle, and end.\u003c\/p\u003e\n\u003cp\u003eI think IÂ am a body and its stories are important.\u003c\/p\u003e\n\u003cp\u003eI amÂ not a body. Its stories are only as important as IÂ have them be.\u003c\/p\u003e","template_suffix":"","handle":"you-are-not-what-you-think-you-are","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387549102115","image":{"created_at":"2020-10-09T15:26:22-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_6533f00e-3d52-4bad-a631-53754e392f6f.png?v=1602278783"}},{"id":387527311395,"title":"Meditation from ACIM Lesson 44","created_at":"2020-10-04T12:10:56-06:00","body_html":"\u003cp\u003eTaken directly from A Course in Miracles, Lesson 44: \"God is the Light in which I see.\"\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"Https:\/\/stobblehouse.com\/text\/ACIM.pdf#page=188\" target=\"_blank\" title=\"lesson 44\" rel=\"noopener noreferrer\"\u003e[Full Text]\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eSuggested ideas for this exercise (pick one or bring your own):\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003e\"God is the Light in which I see.\"\u003c\/li\u003e\n\u003cli\u003e\"God is the Mind with which I think.\"\u003c\/li\u003e\n\u003cli\u003e\"I am as God created me.\"\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003chr\u003e\n\u003cp\u003eBegin the practice period by repeating the day's idea with your eyes open and close them slowly, repeating the idea several times more. Then try to sink into your mind, letting go every kind of interference and intrusion by quietly sinking past them. Your mind cannot be stopped in this unless you choose to stop it. It is merely taking its natural course. Try to observe your passing thoughts without involvement and slip quietly by them.\u003cbr\u003e\u003cbr\u003eWhile no particular form of approach is advocated, what is needful is a sense of the importance of what you are doing, its inestimable value to you, and an awareness that you are attempting something very holy. Salvation is your happiest accomplishment. It is also the only one that has any meaning because it is the only one that has any use to you at all.\u003cbr\u003e\u003cbr\u003eIf resistance rises in any form, pause long enough to repeat the day's idea, keeping your eyes closed unless you are aware of fear. In that case, you will probably find it more reassuring to open your eyes briefly. Try, however, to return to the exercises as soon as possible.\u003cbr\u003e\u003cbr\u003eIf you are doing the exercises correctly, you should experience some sense of relaxation and even a feeling that you are approaching if not actually entering into light. Try to think of light, formless and without limit, as you pass by the thoughts of this world. And do not forget that they cannot hold you to the world unless you give them the power to do so.\u003cbr\u003e\u003cbr\u003eThroughout the day, repeat the idea often with eyes open or closed as seems better to you at the time. Do not forget. Above all, be determined not to forget today.\u003c\/p\u003e\n\u003cp\u003e- jesus\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003eGive it a try.\u003c\/p\u003e\n\u003cp\u003eRelax. Pass interference. Seek the light. Do not forget. Remember.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-04T12:10:56-06:00","updated_at":"2020-10-06T09:20:13-06:00","summary_html":"\u003cp\u003e\u003cspan\u003eTaken directly from A Course in Miracles, Lesson 44: \"God is the Light in which I see.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e1. Relax. 2. Pass interference. 3. Seek the light. 4. Do not forget. Remember.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003eThe Course says it better, read the whole post.\u003c\/p\u003e","template_suffix":"","handle":"meditation-from-acim-lesson-44","tags":"meditation technique","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387527311395","image":{"created_at":"2020-10-06T09:20:12-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_50edb791-afb3-4236-91a2-a108c37968de.png?v=1601997613"}},{"id":387522822179,"title":"Lesson 186: Salvation of the world depends on me.","created_at":"2020-10-02T13:56:24-06:00","body_html":"\u003cstyle\u003e\u003c!--\n.centering-box { border: 1px solid #ababab; display: flex; justify-content:center; align-items:center; margin: 2em 0; padding: 1em 0;}\n--\u003e\u003c\/style\u003e\n\u003cp\u003e\u003cspan\u003eHere is the statement that will one day take all arrogance away from every mind. Here is the thought of true humility which holds no function as your own but that which has been given you. It offers your acceptance of a part assigned to you, without insisting on another role. It does not judge your proper role. It but acknowledgesÂ \u003c\/span\u003e\u003cb\u003ethe Will of God is done\u003c\/b\u003e\u003cspan\u003eÂ on earth as well as Heaven. It unites all wills on earth in Heaven's plan to save the world, restoring it to Heaven's peace.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eLet us not fight our function. We did not establish it. It is not our idea. The means are given us by which it will be perfectly accomplished. All that we are asked to do is to accept our part in genuine humility and not deny with self-deceiving arrogance that we are worthy. What is given us to do we have the strength to do. Our minds are suited perfectly to take the part assigned to us by One Who knows us well.\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eToday's idea may seem quite sobering until you see its meaning. All it says is that your Father still remembers you and offers you the perfect trust He holds in you who are His Son. It does not ask that you be different in any way from what you are. What could humility request but this? And what could arrogance deny but this? Today we will not shrink from our assignment on the specious grounds that modesty is outraged. It is pride that would deny the call of God Himself.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eAll false humility we lay aside today that we may listen to God's Voice reveal to us what He would have us do. We do not doubt our adequacy for the function He will offer us. We will be certain only that He knows our strengths, our wisdom, and our holiness. And if He deems us worthy, so we are. It is but arrogance that judges otherwise.\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eThere is one way and only one to be released from the imprisonment your plan to prove the false is true has brought to you. Accept the plan you did not make instead. Judge not your value to it. If God's Voice assures you that salvation needs your part and that the whole depends on you, be sure that it is so. The arrogant must cling to words, afraid to go beyond them to experience which might affront their stance. Yet are the humble free to hear the Voice which tells them what they are and what to do.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eArrogance makes an image of yourself that is not real. It is this image which quails and retreats in terror as the Voice for God assures you that you have the strength, the wisdom, and the holiness to go beyond all images. You are not weak, as is the image of yourself. You are not ignorant and helpless. Sin cannot tarnish the truth in you, and misery can come not near the holy home of God.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eAll this the Voice for God relates to you. And as He speaks, the image trembles and seeks to attack the threat it does not know, sensing its basis crumble. Let it go. Salvation of the world depends on you and not upon this little pile of dust. What can it tell the holy Son of God? Why need he be concerned with it at all?\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eAnd so we find our peace. We will accept the function God has given us, for all illusions rest upon the weird belief that we can make another for ourselves. Our self-made roles are shifting, and they seem to change from mourner to ecstatic bliss of loved and loving. We can laugh or weep and greet the day with welcome or with tears. Our very being seems to change as we experience a thousand shifts in mood, and our emotions raise us high indeed or dash us to the ground in hopelessness.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eIs \u003cem\u003ethis\u003c\/em\u003e the Son of God?\u003c\/strong\u003e Could He create such instability and call it Son? He Who is changeless shares His attributes with His creation. All the images His Son appears to make have no effect on what he is. They blow across his mind like windswept leaves that form a patterning an instant, break apart to group again, and scamper off. Or like mirages seen above a desert, rising from the dust.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThese unsubstantial images will go and leave your mind unclouded and serene when you accept the function given you. The images you make give rise to but conflicting goals, impermanent and vague, uncertain and ambiguous. Who could be constant in his efforts or direct his energies and concentrated drive toward goals like these? The functions which the world esteems are so uncertain that they change ten times an hour at their most secure. What hope of gain can rest on goals like this?\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eIn lovely contrast, certain as the sun's return each morning to dispel the night, your truly given function stands out clear and wholly unambiguous. There is no doubt of its validity. It comes from One Who knows no error. And His Voice is certain of its messages. They will not change nor be in conflict. All of them point to one goal, and one you can attain. Your plan may be impossible, but God's can never fail because He is its Source.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eDo as His Voice directs. And if it asks a thing of you that seems impossible, remember Who it is that asks and who would make denial. Then consider thisâ€”\u003cstrong\u003ewhich is more likely to be right?\u003c\/strong\u003e The Voice that speaks for the Creator of all things Who knows all things exactly as they are, or 6? Let not its voice direct you. Hear instead a certain Voice Which tells you of a function given you by your Creator, Who remembers you and urges that you now remember Him.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/lesson_189_who_right_480x480.png?v=1601670642\" alt=\"which is more likely right God or ego?\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eHis gentle Voice is calling from the known to the unknowing. He would comfort you, although He knows no sorrow. He would make a restitution, though He is complete; a gift to you, although He knows that you have everything already. He has thoughts which answer every need His Son perceives, although He sees them not. For Love must give, and what is given in His Name takes on the form most useful in a world of form.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThese are the forms which never can deceive, although they come from Formlessness Itself. Forgiveness is an earthly form of love which as it is in Heaven has no form. Yet what is needed here is given here as it is needed. In this form, you can fulfill your function even here, although what love will mean to you when formlessness has been restored to you is greater still. Salvation of the world depends on you who can forgive. Such is your function here.\u003c\/span\u003e\u003c\/p\u003e\n\u003cdiv class=\"centering-box\"\u003e\n\u003ci\u003epause and reflectÂ \u003c\/i\u003e\u003cspan\u003eðŸ•\u003c\/span\u003e\n\u003c\/div\u003e\n\u003chr\u003e\n\u003cp\u003eThe salvation of the world depends on me. Who am I?\u003c\/p\u003e\n\u003cp\u003ePause and reflect.\u003c\/p\u003e\n\u003cp\u003eTake your time.\u003c\/p\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/me_time_240x240.gif?v=1601671709\" alt=\"favorite time is me time\" style=\"margin-right: 58.4px; margin-left: 58.4px; float: none;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center; font-size: .8em; margin-top: -1em;\"\u003e\u003ca href=\"https:\/\/giphy.com\/gifs\/bed-relax-chill-l4FGopFsKaTuEIkLK\"\u003evia GIPHY\u003c\/a\u003e\u003c\/div\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-10-02T14:50:12-06:00","updated_at":"2020-10-02T15:32:19-06:00","summary_html":"\u003cspan\u003eHere is the statement that will one day take all arrogance away from every mind. Here is the thought of true humility which holds no function as your own but that which has been given you. It offers your acceptance of a part assigned to you, without insisting on another role. It does not judge your proper role. It but acknowledgesÂ \u003c\/span\u003e\u003cb\u003ethe Will of God is done\u003c\/b\u003e\u003cspan\u003eÂ on earth as well as Heaven. It unites all wills on earth in Heaven's plan to save the world, restoring it to Heaven's peace.\u003c\/span\u003e","template_suffix":"","handle":"lesson-186-salvation-of-the-world-depends-on-me","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387522822179","image":{"created_at":"2020-10-02T13:56:24-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_1d37eb22-dc6a-4048-9bf5-ea3d58e7ff73.png?v=1601668585"}},{"id":387507519523,"title":"Lesson 26: My attack thoughts are attacking my invulnerability.","created_at":"2020-09-28T22:45:42-06:00","body_html":"\u003ch2\u003eA Course in Miracles: Workbook for Students\u003c\/h2\u003e\n\u003ch3\u003eLesson 26:Â \u003ci\u003eMy attack thoughts are attacking my invulnerability.\u003c\/i\u003e\n\u003c\/h3\u003e\n\u003cp\u003eIt is surely obvious that if you can be attacked you are not invulnerable. You see attack as a real threat. That is because you believe that you can really attack. And what would have effects through you must also have effects on you. It is this law that will ultimately save you, but you are misusing it now. You must therefore learn how it can be used for your own best interests, rather than against them.\u003c\/p\u003e\n\u003cp\u003eAsk yourself:\u003c\/p\u003e\n\u003cp\u003eHow can I know who I am when I see myself as under constant attack? Pain, illness, loss, age, and death seem to threaten me. All my hopes and wishes and plans appear to be at the mercy of a world I cannot control. Yet perfect security and complete fulfillment are my inheritance. I have tried to give my inheritance away in exchange for the world I see. But God has kept my inheritance safe for me. My own real thoughts will teach me what it is.\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=146\" target=\"_blank\" title=\"acim workbook 26\" rel=\"noopener noreferrer\"\u003e[Full Text]\u003c\/a\u003e\u003c\/p\u003e\n\u003ch3\u003eThe Practice:\u003c\/h3\u003e\n\u003cp\u003e\u003cspan\u003eSix practice periods are required in applying today's idea. A full two minutes should be attempted for each of them, although the time may be reduced to a minute if the discomfort is too great. Do not reduce it further.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThe practice period should begin with repeating the idea for today, then closing your eyes and reviewing the unresolved situations whose outcomes are causing you concern. The concern may take the form of depression, worry, anger, a sense of imposition, fear, foreboding, or preoccupation. Any problem as yet unsettled which tends to recur in your thoughts during the day is a suitable subject. You will not be able to use very many for any one practice period, because a longer time than usual should be spent with each one. Today's idea should be applied as follows:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eFirst, name the situation:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cspan\u003e\u003ci\u003eI am concerned about ______\u003c\/i\u003e.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cspan\u003eThen go over every possible outcome which has occurred to you in that connection and which has caused you concern, referring to each one quite specifically, saying:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cspan\u003e\u003ci\u003eI am afraid ______ will happen\u003c\/i\u003e.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cspan\u003eIf you are doing the exercises properly, you should have some five or six distressing possibilities available for each situation you use and quite possibly more. It is much more helpful to cover a few situations thoroughly than to touch on a larger number.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cspan\u003eAs the list of anticipated outcomes for each situation continues, you will probably find some of them, especially those which occur to you toward the end, less acceptable to you. Try, however, to treat them all alike to whatever extent you can.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cspan\u003eAfter you have named each outcome of which you are afraid, tell yourself:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cspan\u003e\u003ci\u003eThat thought is an attack upon myself\u003c\/i\u003e.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003e\u003cspan\u003eConclude each practice period by repeating today's idea once more.\u003c\/span\u003e\u003c\/p\u003e\n\u003ch3 style=\"text-align: left;\"\u003e\u003cspan\u003eMy attack thoughts are attacking my invulnerability.\u003c\/span\u003e\u003c\/h3\u003e\n\u003cp\u003e\u003cstrong\u003eRecap:\u003c\/strong\u003e\u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003cspan\u003eName the situation:Â \u003ci\u003eI am concerned about ______\u003c\/i\u003e.\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003e\u003cspan\u003eList the outcomes of the situation that worry you:Â \u003ci\u003eI am afraid ______ will happen\u003c\/i\u003e.\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003e\u003cspan\u003eAfter each outcome, tell yourself:Â \u003ci\u003eThat thought is an attack upon myself\u003c\/i\u003e.\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003e\u003cspan\u003eRepeat.\u003c\/span\u003e\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003e\u003cspan\u003e- jesus\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-09-28T22:45:53-06:00","updated_at":"2020-09-28T23:14:00-06:00","summary_html":"\u003cp\u003e\u003cspan\u003eA practical meditation exercise contained within ACIM Workbook, Lesson 26. An overview of the lesson and detailed exercise.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eIt is surely obvious that if you can be attacked you are not invulnerable. You see attack as a real threat. That is because you believe that you can really attack. And what would have effects through you must also have effects on you. It is this law that will ultimately save you, but you are misusing it now. You must therefore learn how it can be used for your own best interests, rather than against them.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":"","handle":"lesson-26-my-attack-thoughts-are-attacking-my-invulnerability","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387507519523","image":{"created_at":"2020-09-28T22:45:42-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_228c051f-e8a6-4184-a055-46e64b58393f.png?v=1601354742"}},{"id":387490185251,"title":"Reinterpretation Experiences","created_at":"2020-09-23T22:49:25-06:00","body_html":"\u003cp\u003eAs I started with a Course in Miracles, I realized I was carrying baggage from my past. The Course directs us to alleviate the baggage by \"forgiveness\". (Ultimately, we are advised to alleviateÂ \u003cem\u003eeverything\u003c\/em\u003e by forgiveness, limiting beliefs and destructive ideas about myself were my primary concerns.) While these days I focus on in a state of constant forgiveness, earlier days were often filled with egoic thoughts of unworthiness, anger, and doubt. Then I came to thoughts like these within the Course:\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003e We are embarking on an organized, well-structured, and carefully planned program aimed at learning how to offer to the Holy Spirit everything you do \u003cem\u003enot\u003c\/em\u003e want. \u003cem\u003eHe\u003c\/em\u003e knows what to do with it. You do \u003cem\u003enot\u003c\/em\u003e know how to use what He knows. Whatever is revealed to Him that is not of God is gone. Yet you must reveal it to \u003cem\u003eyourself\u003c\/em\u003e in perfect willingness, for otherwise His knowledge remains useless to you. Surely He will not fail to help you, since help is His only purpose. \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=Tx:\u0026amp;P=11.23\u0026amp;W=116\" target=\"_blank\" title=\"acim chapter 11 original edition\" rel=\"noopener noreferrer\"\u003eTx:11.23 A Course in Miracles\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eTo me, this seemed to be an invitation to allow the HS to reinterpret my negative thoughts. As I speak about in a different post, this reinterpretation is not the ultimate goal, but it is a step within the plan of forgiveness. It is impossible to forgive a situation that has been condemned; we have already judged it negatively. If it is brought to mind, it is remembered as negative. By allowing the Spirit to first place a reinterpretation of how the experience was only helpful, forgiveness or acceptance is only the natural response. This is much easier than \"forgiving\" something seen as negative (the Course calls this \u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=Tx:\u0026amp;P=30.73\u0026amp;W=12\u0026amp;S=17\u0026amp;term=false%20forgiveness\u0026amp;I=73\" target=\"_blank\" title=\"tx:30.73 false forgiveness OE\" rel=\"noopener noreferrer\"\u003efalse forgiveness\u003c\/a\u003e).\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eBackground on a.b\u003c\/h2\u003e\n\u003cp\u003eBefore I became the holiest and humblest miracle worker and designer you know today, I was Real Dumb socially. My options coming out of kindergarten were gifted and talented or special education classes. I guess I scored high enough on some test because I was placed in GT. This did not help me make social connections. This troubled me for a long time. I felt set up for failure and in a hopeless situation.\u003c\/p\u003e\n\u003cp\u003eI'll cover two situations wherein the Holy Spirit reinterpreted my misunderstandings before true forgiveness could arise.\u003c\/p\u003e\n\u003ch2\u003eSituation 1: Social inability\u003c\/h2\u003e\n\u003cp\u003eI stuttered or talked too fast and generally was unintelligible. I couldnâ€™t look people in the eyes. I had no hygiene practice until I was into my 20s. My clothes were full of holes and usually unwashed. And I had no ability to pick up these skills by watching and learning from others. â€œObservational learningâ€ was not in my skillset. People my age\u003cspan\u003eÂ \u003c\/span\u003e\u003cspan\u003eavoided me\u003c\/span\u003e\u003cspan\u003eÂ \u003c\/span\u003eand non-related adult caregivers\u003cspan\u003eÂ \u003c\/span\u003e\u003cspan\u003eavoided me\u003c\/span\u003e\u003cspan\u003eÂ \u003c\/span\u003e(for the above reasons presumably), and familial adults\u003cspan\u003eÂ \u003c\/span\u003e\u003cspan\u003ecould not care less\u003c\/span\u003e.\u003c\/p\u003e\n\u003cp\u003eWhat made matters worse in my perception was that I had no social safety net if I failed to figure this stuff out. I was rejected and alone. This was really a fly or die situation.\u003c\/p\u003e\n\u003cp\u003eEvery leap and bound I made in being a person that could interact positively with another generally came through a very intentional seeking out of advice online (Google and WikiHow), discerning of its appropriateness, and intentional integration into daily life. â€œHow do I talk to strangers?â€ â€œWhat is basic hygiene?â€ â€œHow to be confidentâ€\u003c\/p\u003e\n\u003ch3\u003eHS Interpretation\u003c\/h3\u003e\n\u003cp\u003eThis is one of the first conflicts in my mind I offered to the Holy Spirit. I hated being a person that literally did not understand how to move through society. It was a block that brought up thoughts of lack of confidence when I would even attempt to be social and remedy the perceived problem.\u003c\/p\u003e\n\u003cp\u003eHere is an understanding I received:\u003c\/p\u003e\n\u003cp\u003eMy \"ground-zero\" understanding of social skills was analogous to my spiritual understanding, my lack thereof.\u003c\/p\u003e\n\u003cp\u003eMy years of grinding away at learning something that I perceived as utmost important, \"fly or die\", prepared me for starting at the bottom of learning in a spiritual sense. Just as socially, my spiritual guidance was zero to none externally. I would have to sit, spend time, and figure it out on my own.\u003c\/p\u003e\n\u003cp\u003eInstead of using the internet, I had books and an inner teacher. And even finding the right ones of those took trial, error, and discernment. My practice of seeking advice, filtering the advice through my intuition, and intentional integration of understandings were the exact skills I needed as an early student of A Course in Miracles, literally indispensable.\u003c\/p\u003e\n\u003cp\u003eIn being born with this seemingly negative limitation and accepting that I had a choice to change my relationship to it, I learned how to engage with my spiritualÂ in a way that focused on humility, experience-seeking, and understanding.\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eSituation 2: Lack of relationships\u003c\/h2\u003e\n\u003cp\u003eI never understood make-believe as a child. I particularly remember an experience where I was utterly floored tat my (pre-kindergarten) classmates would come to school to make plastic eggs in a plastic skill and serve them with plastic spatulas. And pretend to eat them! Like...Danielle, did you eat the egg or not because it is literally still on your plate. You have to put it in your mouth and chew. Say \"Ahh\".. (They didn't invite me back to playtime.)\u003c\/p\u003e\n\u003cp\u003eThis evolved into me being unable to accept â€œrolesâ€ as an adult â€“ student, â€œbest friendâ€, girlfriend, sister, daughter, subordinateâ€¦ I just donâ€™t understand what these roles are supposed to\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003edo.\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003eEvery person playing the role opposite of mine â€“ teacher, friend, partner, parent, boss â€“ had their expectations, but all I could see was the arbitrary and needy nature of their expectations. It always felt like make-believe.\u003c\/p\u003e\n\u003cp\u003eMoreover, I never felt that they could \"complete me\", or whatever it was that made them need me around; I never shared their needs. If it needs saying, I was not invited back to those relationships where I refused to satisfy the other's \"needs\" (most of them.) I remained aloof and rejected, not understanding how to connect on a real level.\u003c\/p\u003e\n\u003ch3\u003eHS Interpretation\u003c\/h3\u003e\n\u003cp\u003eWhat I have described as this relationship based on seeking to fill a lack perceived within myself with another person, is what the Course calls a special relationship.\u003c\/p\u003e\n\u003cp\u003eApparently, I suck at special relationships. Usually, I'd say \"sucks to suck\", but this time.. I think J.\u003cspan\u003eÂ \u003c\/span\u003e\u003cspan\u003eKrishnamurtiÂ \u003c\/span\u003esays it plainly:\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eIt is no measure of health to be well adjusted to a profoundly sick society.\u003c\/p\u003e\n\u003cp\u003eJiddu 'a.b' Krishnamurti\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eI was then invited to continue the practice of not seeking for my completion, or a filling of a sense of lack, externally. I \u003cem\u003ehave no lack\u003c\/em\u003e and \u003cem\u003ethat\u003c\/em\u003e could only be understood by seeking internally.\u003c\/p\u003e\n\u003cp\u003eI still had questions about my seeming\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003einability\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eto build relationships. As I put it, \"it is also not a measure of health to be poorly adjusted\".\u003c\/p\u003e\n\u003cp\u003eHe answered something like: \"The world (society) is not there. Forgiveness of this perception of yourself as poorly adjusted would be a better use of your time than learning how toÂ adjust to illusion. The other path you could have taken would have been to believe you were well-adjusted andÂ \u003cspan\u003e\u003c\/span\u003e\u003cem\u003eunlearn\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003ethat. It is easier to forgive this negative perception of yourself, isn't it? I will guide your interactionsÂ \u003cstrong\u003eperfectly\u003c\/strong\u003e. What is more well adjusted than that?\"\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eForgiveness is the key to happiness\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=383\" target=\"_blank\" title=\"lesson 169 fip\" rel=\"noopener noreferrer\"\u003e(#169)\u003c\/a\u003e\n\u003c\/li\u003e\n\u003cli\u003eI do not perceive my own best interest\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=142\" target=\"_blank\" title=\"lesson 142 fip\" rel=\"noopener noreferrer\"\u003e(#24)\u003c\/a\u003e\n\u003c\/li\u003e\n\u003cli\u003eI do not have to worry about what to say or what to do, because he who sent me will direct me.\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=1726\" target=\"_blank\" title=\"principles of miracle workers, fip\" rel=\"noopener noreferrer\"\u003e(Principles of Miracle Workers)\u003c\/a\u003e\n\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eThanks, Jesus.\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eConclusion\u003c\/h2\u003e\n\u003cp\u003eWhen I was\/am willing to give up my negative views about my perceived shortcomings or failures, understandings arose in my awareness that were not there before.\u003c\/p\u003e\n\u003cp\u003eIt is hard to impress via blog howÂ \u003cem\u003einjured\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eI was by my past. I was a broken shell, deservedly unworthy because, from my perspective, my social inability and the lack of relationships stemming from that were my own burdens to bear. I was born deficient and I was going to succeed via struggle to fill my brain with the right information that solved the deficiency or die trying.Â \u003cstrong\u003eDying trying\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003ewas the likeliest outcome.\u003c\/p\u003e\n\u003cp\u003eAnother very important experiential fact to impress was how simply and quickly the interpretations entered my mind when I quieted and cleared all thoughts. It was like an \"ah-ha!\" moment, like a light bulb suddenly illuminating.\u003c\/p\u003e\n\u003cp\u003eLiterally these miracles seen in light washed away my fears.\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eWhen everything has meaning beyond their forms, when everything is painted with the brush of Love for my well-being and growth,Â when nothing can shake my peace because I understand that there is nothing not under direction of the Spirit, this is true vision.\u003c\/span\u003e\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003eMiracles are seen in light\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=303\" target=\"_blank\" title=\"lesson 91 acim fip\" rel=\"noopener noreferrer\"\u003eLesson 91,\u003c\/a\u003e \u003cem\u003eA Course in Miracles\u003c\/em\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eWhen you're feeling stuck, do us all a favor and ask a Trusted Friend for help. The salvation of the world depends on it ;)\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cp\u003eThe companion post to this article\u003c\/p\u003e\n\u003ch2 style=\"margin-top: 1em; margin-bottom: 1em; text-decoration:underline;\"\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/blogs\/a-b-sees\/forgiveness-beautiful-not-numbing\" target=\"_blank\" title=\"forgiveness beautiful not numbing a.b\" rel=\"noopener noreferrer\"\u003eForgiveness: Beautiful not numbing\u003c\/a\u003e\u003c\/h2\u003e\n\u003cp\u003econtains the step-by-step thought exercise that brought about these reinterpretations\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-09-23T22:49:25-06:00","updated_at":"2020-09-23T23:15:31-06:00","summary_html":"\u003cp\u003e\u003cstrong\u003eWe are embarking on an organized, well-structured, and carefully planned program aimed at learning how to offer to the Holy Spirit everything you do\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003enot\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003ewant.\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003eHe\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eknows what to do with it. You do\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003enot\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eknow how to use what He knows.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThis seemed to be an invitation to allow the HS to reinterpret my negative thoughts. This reinterpretation is not the ultimate goal, but it is a step within the plan of forgiveness. It is impossible to forgive a situation that has been already judged negatively. By allowing the Spirit to first place a reinterpretation of how the experience was \u003cem\u003eonly\u003c\/em\u003e helpful, forgiveness or acceptance is only the natural response.\u003c\/p\u003e","template_suffix":"","handle":"reinterpretation-experiences","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387490185251","image":{"created_at":"2020-09-23T22:49:25-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_05a031a0-07f6-429c-856c-4be828fe745f.png?v=1600922966"}},{"id":387489857571,"title":"Forgiveness: Beautiful not numbing","created_at":"2020-09-23T20:14:26-06:00","body_html":"\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003eForgiveness is acquired. ... As sin is an idea you taught yourself, forgiveness must be learned by you as well, but from a Teacher other than yourself, Who represents the other Self in you. Through Him you learn how to forgive the self you think you made, and let it disappear.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=383\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\" title=\"lesson 169 fip\"\u003eWorkbook 169\u003c\/a\u003e\u003cspan\u003eÂ \u003c\/span\u003e- Forgiveness is the key to happiness\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eAn idea dawned on me. It is an idea\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003etoward\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003ethe idea that \"nothing happened\", but it is simpler for me to process. I find that as I allow reinterpretation and forgive with exercises like below, I am better able to forgive present situations more quickly.\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003eWhat Forgiveness Feels Like\u003c\/h2\u003e\n\u003cp\u003e\u003cstrong\u003eTrue forgiveness will be experienced as a release, like coming up for air after being under water; it is not a numbing. True forgiveness happens when you understand\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003e\u003cstrong\u003ewhy\u003c\/strong\u003e\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003ethe experience happened,\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003e\u003cstrong\u003ehow\u003c\/strong\u003e\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003eit helped you grow, and you love yourself and the other actors in the experience more for the experience having happened.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eEssentially, if you are upset with a situation, you have determined that you understand what the situation was for, and not only that, it was a very bad situation.\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003eUndo that thought\u003c\/strong\u003e. Accept that\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003emaybemaybemaybe\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eyou misinterpreted what happened. We all make mistakes, humble up, little willingness, etc. Then go into deep meditation with something like \"Holy Spirit, what really happened in this experience?\". Something like that.\u003c\/p\u003e\n\u003cp\u003eHow this usually plays out for me is I:\u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eaccept that I am not upset for the reason I think (\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=207\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\"\u003eLesson 51\u003c\/a\u003e),\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003erealize the other people are, according to the course, other Sons of God searching for peace and joy imperfectly, confounded by ego (\"\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=1527\" class=\"_3t5uN8xUmg0TOwRCOGQEcU\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\"\u003eBecause I will to know myself, I see you as God's Son and my brother.\u003c\/a\u003e\")\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003ego into deep meditation with the question \"How was this an experience of Love, what can I learn from this?\"\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003eIf the above steps don't work, I accept that my holding onto anger\/irritation\/desire for vengeance could be an unconscious desire of my own to simply not be peaceful or joyous. And the \"experience\" that I'm \"not forgiving\" is just a boogeyman that I'm allowing to live in my mind to be a scapegoat when I want to lash out internally. In this way, letting it go is a mercy to myself.\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eThere will be an answer. I accept that my hearing is dependent on my willingness to hear. Maybe it is not the right time to heal, maybe it is. If it's not the right time to heal, I can try to be at peace with the present moment and my current state of being.\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003eHe would not leave an unforgiving thought without \u003cu\u003ecorrection\u003c\/u\u003e, nor one thorn or nail to hurt His holy Son in any way.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=383\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\"\u003eWorkbook 169\u003c\/a\u003e\u003cspan\u003eÂ \u003c\/span\u003e- Forgiveness is the key to happiness\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003chr\u003e\n\u003ch2\u003eUltimate Goal\u003c\/h2\u003e\n\u003cp\u003e\u003cspan\u003ePoint of note:Â this reinterpretation is not the ultimate goal, but it is a step within the plan of forgiveness. It is impossible to forgive a situation that has been condemned; we have already judged it negatively.Â \u003c\/span\u003eI feel that if I learn how to allow internal reinterpretation, I will have a useful tool for awakening, but there will be more understandings to learn. I can use this tool of reinterpretation to build trust in my mind and mental capabilities.\u003c\/p\u003e\n\u003cp\u003eIf I master this, I feel I can have peace for a lifetime if a peaceful human life is my goal.\u003c\/p\u003e\n\u003cp\u003eIf I master this and further it logically, I learn that literally everything that has occurred in my life was for my betterment and guidance.\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003eAll things are lessons God would have me learn.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=578\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\" title=\"lesson 193 fip\"\u003eWorkbook 193\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eAnd by understanding that all things in my past were for my bettermentÂ \u003cem\u003eonly\u003c\/em\u003e, I easily see that all new events that come into my awareness are for my good as well.\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cstrong\u003eAll things are echoes for the Voice of God.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=463\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\" title=\"lesson 151 fip\"\u003eWorkbook 151\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eWhen everything has meaning beyond the harsh colliding of forms, when everything is painted with the brush of Love for my well-being and growth, this is true vision. (At least truer vision!)\u003c\/p\u003e\n\u003cp\u003eFrom the \u003ca href=\"https:\/\/facim.org\/glossary\/vision\/\" target=\"_blank\" title=\"fip defintion vision\" rel=\"noopener noreferrer\"\u003eFoundation for Inner Peace's Glossary of terms:\u003c\/a\u003e\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003eVision\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003ethe perception of Christ or the Holy Spirit that sees beyond the body to the spirit that is our true Identity; the vision of forgiveness and sinlessness through which is seen the real world; purely internal, reflecting a decision to accept reality rather than judge it; a shift in attitude from the egoâ€™s purpose for the body (specialness) to the Holy Spiritâ€™s (forgiveness), and thus is not to be equated with physical sight.\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eEverything that happens in my frame of awareness is the Voice of God presenting a lesson for my understanding. The only barrier for my learning the lesson is my own desire to give the situationÂ \u003cem\u003emy\u003c\/em\u003e own meaning, a judgement I have learnedÂ based on opinions and positions I am carrying from my past.\u003c\/p\u003e\n\u003cp\u003eI can either be a judgmental separated self or I can be at peace with what is. A still watcher, quietly doing nothing, merely looking and waiting and judging not. Am I confident that right action will arise?\u003c\/p\u003e\n\u003cp\u003e......\u003c\/p\u003e\n\u003cp\u003eI am.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cp\u003eFor in depth Experience Reports of how this process has helped me, check out this other article\u003c\/p\u003e\n\u003ch2 style=\"margin-top: 1em; margin-bottom: 1em; text-decoration: underline;\"\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/blogs\/a-b-sees\/reinterpretation-experiences\" target=\"_blank\" title=\"reinterpretation experiences by a.b\" rel=\"noopener noreferrer\"\u003eReinterpretation Experiences\u003c\/a\u003e\u003c\/h2\u003e\n\u003cp\u003ePortions of this postÂ were originally posted on Reddit. \u003ca href=\"https:\/\/www.reddit.com\/r\/ACIM\/comments\/gh6lkv\/forgiveness_beautiful_not_numbing\/\" target=\"_blank\" title=\"r\/acim forgiveness is beautiful\" rel=\"noopener noreferrer\"\u003eJoin the ACIM conversation (and me!) there.\u003c\/a\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-09-23T23:00:45-06:00","updated_at":"2020-09-23T23:17:53-06:00","summary_html":"\u003cp\u003e\u003cspan\u003e\u003cstrong\u003eAs sin is an idea you taught yourself, forgiveness must be learned by you as well, but from a Teacher other than yourself, Who represents the other Self in you. Through Him you learn how to forgive the self you think you made, and let it disappear.\u003c\/strong\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eI can learn to forgive my misunderstandings of myself, others, and experiences by allowing the situation to be reinterpreted closer and closer to the truth until forgiveness is natural.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eEverything that happens in my frame of awareness is the Voice of God presenting a lesson for my understanding. The only barrier for my learning the lesson is my own desire to give the situationÂ \u003cem\u003emy\u003c\/em\u003eÂ own meaning, a judgement I have learnedÂ based on opinions and positions I am carrying from my past.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":"","handle":"forgiveness-beautiful-not-numbing","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387489857571","image":{"created_at":"2020-09-23T23:00:45-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_76385602-3861-48ba-ae81-2123b8105f3e.png?v=1600923646"}},{"id":387463282723,"title":"A Course in Miracles Introduction","created_at":"2020-09-18T10:09:37-06:00","body_html":"\u003cp class=\"first-line-indent\"\u003e\u003csup\u003e1\u003c\/sup\u003e\u003cspan\u003eÂ \u003c\/span\u003eThis is a course in miracles. It is a required course. Only the time you take it is voluntary. Free will does not mean that you can establish the curriculum. It means only that you may elect what you want to take at a given time.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003e\u003csup\u003e2\u003c\/sup\u003e\u003cspan\u003eÂ \u003c\/span\u003eThe course does not aim at teaching the meaning of love, for that is beyond what can be taught. It does aim, however, at removing the blocks to the awareness of love's presence, which is your natural inheritance. The opposite of love is fear, but what is all-encompassing can have no opposite.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003e\u003csup\u003e3\u003c\/sup\u003e\u003cspan\u003eÂ \u003c\/span\u003eThis course can therefore be summed up very simply in this way:\u003c\/p\u003e\n\u003cp class=\"sayings\"\u003e\u003csup\u003e4\u003c\/sup\u003e\u003cspan\u003eÂ \u003c\/span\u003eNothing real can be threatened.\u003cbr\u003eÂ Â Â Nothing unreal exists.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003e\u003csup\u003e5\u003c\/sup\u003e\u003cspan\u003eÂ \u003c\/span\u003eHerein lies the peace of God.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003e- jesus\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-09-18T10:09:37-06:00","updated_at":"2020-09-19T17:17:16-06:00","summary_html":"\u003cp class=\"first-line-indent\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003eThis course can be summed up very simply in this way:\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003eNothing real can be threatened. Nothing unreal exists.\u003c\/p\u003e\n\u003cp class=\"first-line-indent\"\u003eHerein lies the peace of God.\u003c\/p\u003e","template_suffix":"","handle":"a-course-in-miracles-introduction","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/387463282723","image":{"created_at":"2020-09-19T17:17:16-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_14442028-b3e3-4028-93f7-37ad50dd6a4d.png?v=1600557436"}},{"id":384878313507,"title":"Principles of Miracles","created_at":"2020-09-04T23:49:44-06:00","body_html":"\u003cp\u003eIf you're going to do miraclez, you should understand the principles. To understand the principles, read below.\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003e1. There is no order of difficulty in miracles. One is not \"harder\" or \"bigger\"Â than another. They are all the same. All expressions of love are maximal.\u003c\/p\u003e\n\u003cp\u003e2. Miracles as such do not matter. The only thing that matters is their source, which is far beyond evaluation.\u003c\/p\u003e\n\u003cp\u003e3. Miracles occur naturally as expressions of love. The real miracle is the love that inspires them. In this sense everything that comes from love is a miracle.\u003c\/p\u003e\n\u003cp\u003e4. All miracles mean life, and God is the giver of life. His voice will direct you very specifically. You will be told all you need to know.\u003c\/p\u003e\n\u003cp\u003e5. Miracles are habits, and should be involuntary. They should not be under conscious control. Consciously selected miracles can be misguided.\u003c\/p\u003e\n\u003cp\u003e6. Miracles are natural. When they do not occur something has gone wrong.\u003c\/p\u003e\n\u003cp\u003e7. Miracles are everyone's right, but purification is necessary first.\u003c\/p\u003e\n\u003cp\u003e8. Miracles are healing because they supply a lack; they are performed by those who temporarily have more for those who temporarily have less.\u003c\/p\u003e\n\u003cp\u003e9. Miracles are a kind of exchange. Like all expressions of love, which are always miraculous in the true sense, the exchange reverses the physical laws. They bring more love both to the giver and the receiver.\u003c\/p\u003e\n\u003cp\u003e10. The use of miracles as spectacles to induce belief is a misunderstanding of their purpose.\u003c\/p\u003e\n\u003cp\u003e11. Prayer is the medium of miracles. It is a means of communication of the created with the Creator. Through prayer love is received, and through miracles love is expressed.\u003c\/p\u003e\n\u003cp\u003e12. Miracles are thoughts. Thoughts can represent the lower or bodily level of experience, or the higher or spiritual level of experience. One makes the physical, and the other creates the spiritual.\u003c\/p\u003e\n\u003cp\u003e13. Miracles are both beginnings and endings, and so they alter the temporal order. They are always affirmations of rebirth, which seem to go back but really go forward. They undo the past in the present, and thus release the future.\u003c\/p\u003e\n\u003cp\u003e14. Miracles bear witness to truth. They are convincing because they arise from conviction. Without conviction they deteriorate into magic, which is mindless and therefore destructive; or rather, the uncreative use of mind.\u003c\/p\u003e\n\u003cp\u003e15. Each day should be devoted to miracles. The purpose of time is to enable you to learn how to use time constructively. It is thus a teaching device and a means to an end. Time will cease when it is no longer useful in facilitating learning.\u003c\/p\u003e\n\u003cp\u003e16. Miracles are teaching devices for demonstrating it is as blessed to give as to receive. They simultaneously increase the strength of the giver and supply strength to the receiver.\u003c\/p\u003e\n\u003cp\u003e17. Miracles transcend the body. They are sudden shifts into invisibility, away from the bodily level. That is why they heal.\u003c\/p\u003e\n\u003cp\u003e18. A miracle is a service. It is the maximal service you can render to another. It is a way of loving your neighbor as yourself. You recognize your own and your neighbor's worth simultaneously.\u003c\/p\u003e\n\u003cp\u003e19. Miracles make minds one in God. They depend on cooperation because the Sonship is the sum of all that God created. Miracles therefore reflect the laws of eternity, not of time.\u003c\/p\u003e\n\u003cp\u003e20. Miracles reawaken the awareness that the spirit, not the body, is the altar of truth. This is the recognition that leads to the healing power of the miracle.\u003c\/p\u003e\n\u003cp\u003e21. Miracles are natural signs of forgiveness. Through miracles you accept God's forgiveness by extending it to others.\u003c\/p\u003e\n\u003cp\u003e22. Miracles are associated with fear only because of the belief that darkness can hide. You believe that what your physical eyes cannot see does not exist. This leads to a denial of spiritual sight.\u003c\/p\u003e\n\u003cp\u003e23. Miracles rearrange perception and place all levels in true perspective. This is healing because sickness comes from confusing the levels.\u003c\/p\u003e\n\u003cp\u003e24. Miracles enable you to heal the sick and raise the dead because you made sickness and death yourself, and can therefore abolish both. You are a miracle, capable of creating in the likeness of your Creator. Everything else is your own nightmare, and does not exist. Only the creations of light are real.\u003c\/p\u003e\n\u003cp\u003e25. Miracles are part of an interlocking chain of forgiveness which, when completed, is the Atonement. Atonement works all the time and in all the dimensions of time.\u003c\/p\u003e\n\u003cp\u003e26. Miracles represent freedom from fear. \"Atoning\" means \"undoing.\" The undoing of fear is an essential part of the Atonement value of miracles.\u003c\/p\u003e\n\u003cp\u003e27. A miracle is a universal blessing from God through me to all my brothers. It is the privilege of the forgiven to forgive.\u003c\/p\u003e\n\u003cp\u003e28. Miracles are a way of earning release from fear. Revelation induces a state in which fear has already been abolished. Miracles are thus a means and revelation is an end.\u003c\/p\u003e\n\u003cp\u003e29. Miracles praise God through you. They praise him by honoring his creations, affirming their perfection. They heal because they deny body-identification and affirm spirit-identification.\u003c\/p\u003e\n\u003cp\u003e30. By recognizing spirit, miracles adjust the levels of perception and show them in proper alignment. This places spirit at the center, where it can communicate directly.\u003c\/p\u003e\n\u003cp\u003e31. Miracles should inspire gratitude, not awe. You should thank God for what you really are. The children of God are holy and the miracle honors their holiness, which can be hidden but never lost.\u003c\/p\u003e\n\u003cp\u003e32. I inspire all miracles, which are really intercessions. They intercede for your holiness and make your perceptions holy. By placing you beyond the physical laws they raise you into the sphere of celestial order. In this order you are perfect.\u003c\/p\u003e\n\u003cp\u003e33. Miracles honor you because you are lovable. They dispel illusions about yourself and perceive the light in you. They thus atone for your errors by freeing you from your nightmares. By releasing your mind from the imprisonment of your illusions, they restore your sanity.\u003c\/p\u003e\n\u003cp\u003e34. Miracles restore the mind to its fullness. By atoning for lack they establish perfect protection. The spirit's strength leaves no room for intrusions.\u003c\/p\u003e\n\u003cp\u003e35. Miracles are expressions of love, but they may not always have observable effects.\u003c\/p\u003e\n\u003cp\u003e36. Miracles are examples of right thinking, aligning your perceptions with truth as God created it.\u003c\/p\u003e\n\u003cp\u003e37. A miracle is a correction introduced into false thinking by me. It acts as a catalyst, breaking up erroneous perception and reorganizing it properly. This places you under the Atonement principle, where perception is healed. Until this has occurred, knowledge of the Divine Order is impossible.\u003c\/p\u003e\n\u003cp\u003e38. The Holy Spirit is the mechanism of miracles. He recognizes both God's creations and your illusions. He separates the true from the false by his ability to perceive totally rather than selectively.\u003c\/p\u003e\n\u003cp\u003e39. The miracle dissolves error because the Holy Spirit identifies error as false or unreal. This is the same as saying that by perceiving light, darkness automatically disappears.\u003c\/p\u003e\n\u003cp\u003e40. The miracle acknowledges everyone as your brother and mine. It is a way of perceiving the universal mark of God.\u003c\/p\u003e\n\u003cp\u003e41. Wholeness is the perceptual content of miracles. They thus correct, or atone for, the faulty perception of lack.\u003c\/p\u003e\n\u003cp\u003e42. A major contribution of miracles is their strength in releasing you from your false sense of isolation, deprivation and lack.\u003c\/p\u003e\n\u003cp\u003e43. Miracles arise from a miraculous state of mind, or a state of miracle-readiness.\u003c\/p\u003e\n\u003cp\u003e44. The miracle is an expression of an inner awareness of Christ and the acceptance of his Atonement.\u003c\/p\u003e\n\u003cp\u003e45. A miracle is never lost. It may touch many people you have not even met, and produce undreamed of changes in situations of which you are not even aware.\u003c\/p\u003e\n\u003cp\u003e46. The Holy Spirit is the highest communication medium. Miracles do not \u003cbr\u003einvolve this type of communication, because they are temporary communication devices. When you return to your original form of \u003cbr\u003ecommunication with God by direct revelation, the need for miracles is over.\u003c\/p\u003e\n\u003cp\u003e47. The miracle is a learning device that lessens the need for time. It establishes an out-of-pattern time interval not under the usual laws of time. In this sense it is timeless.\u003c\/p\u003e\n\u003cp\u003e48. The miracle is the only device at your immediate disposal for controlling time. Only revelation transcends it, having nothing to do with time at all.\u003c\/p\u003e\n\u003cp\u003e49. The miracle makes no distinction among degrees of misperception. It is a device for perception correction, effective quite apart from either the degree or the direction of the error. This is its true indiscriminateness.\u003c\/p\u003e\n\u003cp\u003e50. The miracle compares what you have made with creation, accepting what is in accord with it as true, and rejecting what is out of accord as false.\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003eA Course in Miracles, Foundation for Inner Peace, chapter 1, section 1\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e- Jesus\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-09-04T23:49:00-06:00","updated_at":"2020-09-05T00:14:51-06:00","summary_html":"\u003cp\u003e\u003cspan\u003eIf you're going to do miracles, you should understand the principles.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003ePrinciple 1:\u003c\/strong\u003eÂ There is no order of difficulty in miracles. One is not \"harder\" or \"bigger\"Â than another. They are all the same.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e\u003cstrong\u003ePrinciple 6:\u003c\/strong\u003eÂ Miracles are natural. When they do not occur something has gone wrong.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThere are 48 more...Read on.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":null,"handle":"principles-of-miracles","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384878313507","image":{"created_at":"2020-09-04T23:49:44-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_62d6ce1f-1268-4a07-9bee-3edd55b95152.png?v=1599284984"}},{"id":384840499235,"title":"\"Salvation of the world depends on me\" forgiving","created_at":"2020-08-29T10:26:30-06:00","body_html":"\u003ch1\u003eSalvation of the world depends on me.\u003c\/h1\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em;\"\u003e\u003ca href=\"https:\/\/acim.org\/workbook\/lesson-186\/\" target=\"_blank\" title=\"ACIM Lesson 186 FIP\" rel=\"noopener noreferrer\"\u003e\u003cem\u003eA Course in Miracles\u003c\/em\u003e,Â Lesson 186\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eHere is a problem: seeingÂ othersâ€™ beliefs as â€œ\u003cstrong\u003ewrong\". \u003c\/strong\u003eThe emphasis is to demonstrate how much you believe this can be the case. Specifically, this will revolve around spiritual beliefs, but all individuals have different paths, histories, and, frankly, randomly drawn conclusions that create their current and final belief set.\u003c\/p\u003e\n\u003cp\u003eLike all things, all a belief set is \u003cem\u003efor\u003c\/em\u003e is forgiveness . An outside observer must forgive their self for seeing the â€œotherâ€ as other and judging them. The believer must learn that their beliefs are illusory and forgive themselves for misbelief.\u003c\/p\u003e\n\u003cp\u003eThis will be an examination of forgiveness via A Course in Miracles' Lesson 186: \u003cstrong\u003eSalvation of the world depends on me.\u003c\/strong\u003e Let's begin.\u003c\/p\u003e\n\u003cdiv style=\"text-align: justify; font-weight: bold; width: 75%; margin: 2em auto;\"\u003e\n\u003cp\u003eHere is the statement that will one day take all arrogance away from every mind. Here is the thought of true humility which holds no function as your own but that which has been given you. It offers your acceptance of a part assigned to you, without insisting on another role. It does not judge your proper role. It but acknowledges the Will of God is done on earth as well as Heaven. It unites all wills on earth in Heaven's plan to save the world, restoring it to Heaven's peace.\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=186.1\u0026amp;I=1\" target=\"_blank\" title=\"ACIM Lesson 186 paragraph 1 OE\" rel=\"noopener noreferrer\"\u003e(paragraph 1)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eAll beliefs reduce to oneâ€™s belief of their core identity as a mind or a body; this belief is obscured by a myriad of opinions\/options\/beliefs that body-identity induces. Political, sexual, religious, racial, socioeconomicâ€¦ the list goes on. \u003cspan style=\"text-decoration: underline;\"\u003eAll\u003c\/span\u003e of these lay within the realm of body-identity.\u003c\/p\u003e\n\u003cp\u003eA mind (an individual) that has been mind-identified may still see these differentiations. If they are visible, the goal should be to avoid investment and learn the lesson being presented. Turn to your inner teacher and ask â€œWhat is this? Why am I being shown this experience?â€. Respect the answer.\u003c\/p\u003e\n\u003cdiv style=\"text-align: justify; font-weight: bold; width: 75%; margin: 2em auto;\"\u003e\n\u003cp\u003eThe arrogant must cling to words, afraid to go beyond them to experience which might affront their stance. Yet are the humble free to hear the Voice which tells them what they are and what to do.\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=186.5\u0026amp;I=1\" target=\"_blank\" title=\"ACIM Lesson 186 paragraph 5\" rel=\"noopener noreferrer\"\u003e(paragraph 5)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eYou donâ€™t get to believe someone else is â€œ\u003cstrong\u003ewrong\u003c\/strong\u003eâ€\/wrong\/dumb. You are not \u003cstrong\u003eright\u003c\/strong\u003e (emphasis \u003cstrong\u003eHis\u003c\/strong\u003e). (\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=151.1\u0026amp;W=403\u0026amp;S=4\u0026amp;term=echoes\u0026amp;I=12\" target=\"_blank\" title=\"ACIM Lesson 151 paragraph 1 OE\" rel=\"noopener noreferrer\"\u003eSee: Lesson 151:1\u003c\/a\u003e) Do you see how your belief about their beliefs is just \u003cem\u003eanother form of belief\u003c\/em\u003e within the realm of body-identity?\u003c\/p\u003e\n\u003cp\u003eYou are only in the world to watch the experience as a mind and learn the lessons it presents. If you get caught up in the story, you have forgotten you are the observer; it would be like shooting a gun at the screen during an action movie.\u003c\/p\u003e\n\u003cdiv style=\"text-align: justify; font-weight: bold; width: 75%; margin: 2em auto;\"\u003e\n\u003cp\u003eAnd so we find our peace. We will accept the function God has given us, for all illusions rest upon the weird belief that we can make another for ourselves. Our self-made roles are shifting, and they seem to change from mourner to ecstatic bliss of loved and loving. Our very being seems to change as we experience a thousand shifts in mood, and our emotions raise us high indeed or dash us to the ground in hopelessness.\u003c\/p\u003e\n\u003cp\u003eIs this the Son of \u003cspan style=\"text-decoration: underline;\"\u003eGod\u003c\/span\u003e? Could He create such instability and call it Son? He Who is changeless shares His attributes with His creation. All the images His Son appears to make have no effect on what he is. They blow across his mind like windswept leaves that form a patterning an instant, break apart to group again, and scamper off.\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=186.8\u0026amp;I=1\" target=\"_blank\" title=\"ACIM Lesson 186 paragraphs 8 and 9\" rel=\"noopener noreferrer\"\u003e(paragraphs 8 \u0026amp; 9)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eThe task right now is to understand thisÂ \u003cspan\u003eâ€”\u003c\/span\u003e if you listen to \u003cem\u003e\u003cu\u003eyour own\u003c\/u\u003e\u003c\/em\u003e inner guide the only outcome is you fulfilling your function as given by God. Be wary of anyone trying to lead you with \u003cem\u003etheir\u003c\/em\u003e inner guide resolutely, as if theirs is â€œ\u003cstrong\u003eright\u003c\/strong\u003eâ€.\u003c\/p\u003e\n\u003cdiv style=\"text-align: justify; font-weight: bold; width: 75%; margin: 2em auto;\"\u003e\n\u003cp\u003eDo as His Voice directs. And if it asks a thing of you that seems impossible, remember Who it is that asks and who would make denial. Then consider this â€” which is more likely to be right? The Voice that speaks for the Creator of all things Who knows all things exactly as they are, or a distorted image of yourself, confused, bewildered, inconsistent and unsure of everything? Let not its voice direct you. Hear instead a certain Voice Which tells you of a function given you by your Creator, Who remembers you and urges that you now remember Him.\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=186.12\u0026amp;I=1\" target=\"_blank\" title=\"ACIM Lesson 186 paragraph 12\" rel=\"noopener noreferrer\"\u003e(paragraph 12)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eYou may be asking: \"Isnâ€™t thisÂ article exactly what I should be wary of?\"\u003c\/p\u003e\n\u003cp\u003eYes. Use discernment.\u003c\/p\u003e\n\u003cp\u003eDoes your intuition align with this? What does your inner guide say? If you come back to this teaching, you come back. If you go, you go. If you do something in between, then that is what it is as well. Respect the events that happen, but do stay \u003cem\u003eaware\u003c\/em\u003e of the events â€“ the literal scenes of experience in your life.\u003c\/p\u003e\n\u003cp\u003eLet's close out the lesson with how to tell if \"forgiveness\" is working:\u003c\/p\u003e\n\u003cdiv style=\"text-align: justify; font-weight: bold; width: 75%; margin: 2em auto;\"\u003e\n\u003cp\u003eHe would comfort you, although He knows no sorrow. He would make a gift to you, although He knows that you have everything already. For Love must give, and what is given in His Name takes on the form most useful in a world of form.\u003c\/p\u003e\n\u003cp\u003eThese are the forms which never can deceive, although they come from Formlessness Itself. Forgiveness is an earthly form of love which as it is in Heaven has no form. Yet what is needed here is given here as it is needed. Salvation of the world depends on you who can forgive. Such is your function here.\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=186.12\u0026amp;I=1\" target=\"_blank\" title=\"ACIM Lesson 186 paragraph 13\" rel=\"noopener noreferrer\"\u003e(paragraphs 13 \u0026amp; 14)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/div\u003e\n\u003cp\u003eIf you feelÂ \u003cstrong\u003ecomforted\u003c\/strong\u003e, at peace, whole and free... It's working.\u003c\/p\u003e\n\u003cp\u003e\"\u003cstrong\u003eThese are the forms which can never deceive..\u003c\/strong\u003e\"Â \u003cspan\u003eâ€“ you'll know it when it happens.\u003c\/span\u003e\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003e\u003cspan\u003ea.b's take? - In short, \u003cstrong\u003e\u003cspan style=\"text-decoration: underline;\"\u003eforgive\u003c\/span\u003e\u003c\/strong\u003e. In long, read this book:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cimg alt=\"acim original edition\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/ACIM-OE_medium.jpg?v=1598717841\" style=\"float: none;\"\u003e\u003c\/p\u003e\n\u003cp style=\"color: gray; text-align: center; margin-top: -1em; font-size: .8em;\"\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/blogs\/ab-is-ba\/get-a-course-in-miracles\" target=\"_blank\" title=\"a.b's links to get A Course in Miracles\" rel=\"noopener noreferrer\"\u003eA Course in Miracles, Original Edition\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eWhat are \u003cspan style=\"text-decoration: underline;\"\u003eyour\u003c\/span\u003e takeaways from Lesson 186?\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-29T10:26:00-06:00","updated_at":"2020-08-29T12:18:44-06:00","summary_html":"\u003cp\u003e\u003cstrong\u003eSalvation of the world depends on me.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cdiv\u003e\n\u003cp\u003e\u003cstrong\u003eHere is the statement that will one day take all arrogance away from every mind. Here is the thought of true humility which holds no function as your own but that which has been given you.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eHere is a problem: seeingÂ othersâ€™ beliefs as â€œwrong\".\u003cstrong\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003c\/strong\u003eAll individuals have different paths, histories and frankly randomly drawn conclusions that create their current and final belief set. A belief set, as all things, is for forgiveness. An outside observer must forgive their self for seeing the â€œotherâ€ as other and judging them. The believer must learn that their beliefs are illusory and forgive themselves for misbelief.\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThis will be an examination of forgiveness via A Course in Miracles' Lesson 186.\u003c\/span\u003e\u003cspan\u003eÂ Let's begin.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/div\u003e","template_suffix":null,"handle":"salvation-of-the-world-depends-on-me-forgiving","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384840499235","image":{"created_at":"2020-08-29T10:26:30-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_8106f1a8-d180-43ce-a07f-61c812f8b11f.png?v=1598718390"}},{"id":384839155747,"title":"Conspicuous Lack of Dots","created_at":"2020-08-28T21:10:31-06:00","body_html":"\u003cp\u003eContinuing my investigation of chapters 10 - 14 of the different editions and I've already come up with this seemingly superficial clue. This is the Table of Contents of ACIM Original Edition.\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_oe.pdf?v=1594679607#page=4\" target=\"_blank\" title=\"Table of Contents ACIM OE\" rel=\"noopener noreferrer\"\u003eWhat's up with Chapter 12?\u003c\/a\u003eÂ Where are the dots?\u003c\/p\u003e\n\u003ch2\u003eFull page:\u003c\/h2\u003e\n\u003cp\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/ch_12_lack_of_dots_w_eyes_large.png?v=1598669990\" alt=\"\"\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eClose-up:\u003c\/h2\u003e\n\u003cp\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/ch_12_lack_of_dots_w_eyes_cropped_q_mark_large.png?v=1598669972\" alt=\"\"\u003e\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003eThe mystery thickens.\u003c\/p\u003e\n\u003cp\u003eFor the start of the investigation see Fun Fact within this post:\u003c\/p\u003e\n\u003ch2 style=\"margin-top:1em;margin-bottom:1em;text-decoration:underline;\"\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/blogs\/a-b-sees\/it-is-impossible-to-see-two-worlds-excerpts-from-chapter-13-12-of-acim\" target=\"_blank\" title=\"it is impossible to see two worlds\" rel=\"noopener noreferrer\"\u003eIt is impossible to see two worlds by a.b\u003c\/a\u003e\u003c\/h2\u003e\n\u003cp\u003eÂ - alex brady\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003eEDIT:\u003c\/h3\u003e\n\u003cp\u003eMaybe I figured it out... \u003cstrong\u003e\"There are no dots to connect.\"\u003c\/strong\u003e Should I stop the investigation now?\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-28T21:07:00-06:00","updated_at":"2020-09-23T23:21:03-06:00","summary_html":"\u003cp\u003e\u003cimg src=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/ch_12_lack_of_dots_w_eyes_cropped_q_mark_large.png?v=1598669972\" alt=\"\"\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_oe.pdf?v=1594679607#page=4\" target=\"_blank\" title=\"Table of Contents ACIM OE\" rel=\"noopener noreferrer\"\u003eWhat's up with Chapter 12?\u003c\/a\u003eÂ Where are the dots?\u003c\/p\u003e\n\u003cp\u003eThe mystery thickens.\u003c\/p\u003e","template_suffix":"","handle":"conspicuous-lack-of-dots","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384839155747","image":{"created_at":"2020-08-28T21:10:32-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_8730c9c9-0bf8-4684-8237-327fdcf19d20.png?v=1598670632"}},{"id":384839057443,"title":"\"It is impossible to see two worlds.\" â€” Excerpts from Chapter 13\/12 of ACIM","created_at":"2020-08-28T19:58:53-06:00","body_html":"\u003cp\u003eHappened to be in Chapter 13 ofÂ \u003cem\u003eA Course in Miracles\u003c\/em\u003e, FIP edition, today and stumbled into this. Nice and succinct excerpts from Section IX: \u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=1432\" target=\"_blank\" title=\"ACIM chapter 13 section 9, FIP\" rel=\"noopener noreferrer\"\u003eThe Attainment of the Real World:\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe peace of God passeth your understanding only in the past. Yet \u003cem\u003ehere \u003c\/em\u003eit is, and you can understand it \u003cem\u003enow\u003c\/em\u003e.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eNo one in this distracted world but has seen some glimpses of the other world about him. Yet while he still lays value on his own [world], he will deny the vision of the other, maintaining that he loves what he loves not, and following not the road that love points out.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eLove leads so gladly! As you follow him, you will rejoice that you have found his company, and learned of him the joyful journey home. You wait but for yourself. To give this sad world over and exchange your errors for the peace of God is but your will. And Christ will always offer you the Will of God, in recognition that you share it with him.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eLeave the passed understanding in the past.\u003c\/p\u003e\n\u003cp\u003eDo it right now. Do it right now. Do it right now. (correct, immediate, upright)\u003c\/p\u003e\n\u003cp\u003eDo what exactly? Keep reading.\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003ch2\u003eThought exercise\u003c\/h2\u003e\n\u003cp\u003eThe following is a guided thought exercise \u003cstrong\u003eby Jesus\u003c\/strong\u003e, same section:\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eLook upon the world you see, and tell yourself:\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: justify; width: 75%; margin: 1em auto;\"\u003e\u003cstrong\u003e\u003cem\u003eThe real world is not like this. It has no buildings and there are no streets where people walk alone and separate. There are no stores where people buy an endless list of things they do not need. It is not lit with artificial light, and night comes not upon it. There is no day that brightens and grows dim. There is no loss. Nothing is there but shines, and shines forever.\u003c\/em\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe world \u003cem\u003eyou\u003c\/em\u003e see must be \u003cem\u003edenied\u003c\/em\u003e, for sight of it is costing you a different kind of vision. \u003cem\u003eYou cannot see both worlds\u003c\/em\u003e, for each of them involves a different kind of seeing, and depends on what you cherish. The sight of one is possible \u003cem\u003ebecause\u003c\/em\u003e you have denied the other. Both are not true, yet either one will seem as real to you as the amount to which you hold it dear.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eAlso known as \"Forgiveness\".\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003ch2\u003eFun fact:\u003c\/h2\u003e\n\u003cp\u003eThe section, Attainment of the Real World, appears in \u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_oe.pdf?v=1594679607#page=133\" target=\"_blank\" title=\"Chapter 12 section 7 - ACIM OE\" rel=\"noopener noreferrer\"\u003eChapter 12 section VII in the Original Edition of ACIM.\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eOn examination, the sections within chapters 10 - 14 have been interestingly reorganized and re-titled between the editions. I may do a write up on that...\u003c\/p\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003e\"It is impossible to see two worlds\"Â \u003c\/p\u003e\n\u003cp\u003eWhat has been your experience with the Two Worlds? (4, 8,Â \u003cspan\u003eâˆž?)\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-28T19:58:00-06:00","updated_at":"2020-08-28T20:02:55-06:00","summary_html":"\u003cp\u003e\u003cstrong\u003eThe peace of God passeth your understanding only in the past. YetÂ \u003cem\u003ehereÂ \u003c\/em\u003eit is, and you can understand itÂ \u003cem\u003enow\u003c\/em\u003e.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eLeave the passed understanding in the past.\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eTell yourself: The real world is not like this. It has no buildings and there are no streets where people walk alone and separate. There are no stores where people buy things they do not need. There is no loss. Nothing is there but shines, and shines forever.\u003c\/strong\u003e\u003c\/p\u003e","template_suffix":null,"handle":"it-is-impossible-to-see-two-worlds-excerpts-from-chapter-13-12-of-acim","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384839057443","image":{"created_at":"2020-08-28T19:58:53-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_a3ae84b5-6ad9-4c10-861f-85db8c6f0a38.png?v=1598666333"}},{"id":384834142243,"title":"Learning to Hear","created_at":"2020-08-27T17:54:39-06:00","body_html":"\u003cp\u003eSomething caught my eyes while reading:\u003c\/p\u003e\n\u003ch3 style=\"text-align: center;\"\u003e\u003cstrong\u003e\u003cem\u003eA Course in Miracles\u003c\/em\u003e Rules for Decision Making #1:\u003c\/strong\u003e\u003c\/h3\u003e\n\u003cblockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cem\u003eToday I will make no decisions by myself.\u003c\/em\u003e\u003c\/p\u003e\n\u003cp\u003eThis means that you are choosing not to be the judge of what to do. But it must also mean you will not judge the situations where you will be called upon to make response. For if you judge them, you have set the rules for how you should react to them. And then another answer cannot but produce confusion and uncertainty and fear.\u003c\/p\u003e\n\u003cp\u003eThis is your major problem now. You still make up your mind, and \u003cem\u003ethen\u003c\/em\u003e decide to ask what you should do. And what you hear may not resolve the problem as \u003cem\u003eyou\u003c\/em\u003e saw it first. This leads to fear, because it contradicts what you perceive and so you feel attacked. And therefore angry. There are rules by which this will not happen. But it does occur at first, while you are \u003cstrong\u003elearning how to hear.\u003c\/strong\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp style=\"text-align: center;\"\u003e~ \u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=Tx:\u0026amp;P=30.4\u0026amp;term=decision\u0026amp;I=2\" target=\"_blank\" title=\"ACIM original edition chapter 30 paragraph 4\" rel=\"noopener noreferrer\"\u003eACIM OE, Chapter 30, paragraphs 4-6, (Tx.4-6). Italics theirs, bold mine.\u003c\/a\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003eÂ \u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003eÂ \u003c\/p\u003e\n\u003cp\u003eLearning how to hear is, I believe, one of the desired outcomes of the mind training aspect of the course.\u003c\/p\u003e\n\u003cp\u003eThis also rings of the \"period of sorting out\" mentioned in \u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=M:\u0026amp;P=4.6\u0026amp;term=sorting%20out\u0026amp;I=7\" target=\"_blank\" title=\"manual for teachers section 4 paragraph 6\" rel=\"noopener noreferrer\"\u003eManual for Teachers section 4\u003c\/a\u003eÂ where the outcome is \"\u003cspan\u003eunderstanding that all things, events, encounters, and circumstances are helpful. It is only to the extent to which they are helpful that any degree of reality should be accorded them in this world of illusion.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003eHowÂ \u003c\/em\u003ethese \"heard\" messages are conveyed and receivedÂ is perhaps an individualized process, but I thought I'd share some learnings I've gained while \"learning to hear.\"\u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003eÂ \u003c\/p\u003e\n\u003cp style=\"text-align: left;\"\u003eHow the guidance sounds:\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003ePerturbations within the field of emotion.\u003c\/strong\u003e Happy\/sad, extreme\/barely (eg terrified\/startled). All of these are valid expressions of an idea. Not good or bad, just understanding. Move toward stimulus, move away from stimulus, you are not a body, you are free.. I always understand the specific application when this happens.\u003c\/p\u003e\n\u003cp\u003eMuch like headphones use electricity to transmit data, fiber optic cables use light, there is a medium of emotions. You know it when you feel it, But there is \u003cu\u003eno form\u003c\/u\u003e. This is our plausible deniability to why this could possibly be not real.\u003c\/p\u003e\n\u003cp\u003e\"God is but Love.\" The Love Iâ€™ve found is in the field of emotions. We have the ability to master it, and to know ourselves more fully in doing so. \"...and therefore so am I.\"\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eConspicuous events in the environment\u003c\/strong\u003eÂ is a call to return to Decision Making 1. I'm pretty sure this works becauseÂ \u003cem\u003eeverything\u003c\/em\u003e in the environment is a call from Him. (\"\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=W1:\u0026amp;P=171.2\u0026amp;W=6\u0026amp;S=21\u0026amp;term=all%20things%20are%20echoes\u0026amp;I=2\" target=\"_blank\" title=\"acim lesson 171 paragraph 2\" rel=\"noopener noreferrer\"\u003eAll things\u003c\/a\u003eÂ are echoes..\")Â A conspicuous thing is a sudden \u003cspan style=\"text-decoration: underline;\"\u003eattentionÂ disturbance\u003c\/span\u003eÂ that allows me a split second to remember to decide again.\u003c\/p\u003e\n\u003cp\u003eOften the conspicuous thing in the environment is really very funny if I think about it; a pun, an inside joke.. (The humor is found \u003cstrong\u003ebecause\u003c\/strong\u003e I look for it, of course, but hey, miracles are seen in levity or something like that).\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eIt reminds me that what I thought was \u003cspan style=\"text-decoration: underline;\"\u003eIs Not.\u003c\/span\u003e\u003c\/strong\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003c\/span\u003e There is usually a belief that need challenging and correction. The ultimate challenged beliefÂ being my insistence that form is primary, the life story important, opinions justified, and the future set.\u003c\/p\u003e\n\u003cp\u003eIf I can accept that correction, \"I am mind\". If I cannot, I can usually admit that I am not ready and be presented with an acceptable answer regarding forgiveness.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003eCaveats: this has workedÂ \u003cem\u003eso far\u003c\/em\u003e, there will probably be more \"hearing avenues\" added as I understand more and some taken away as necessary. Future: in the hands of God.\u003c\/p\u003e\n\u003ch2\u003eThat's me. Q's for you:\u003c\/h2\u003e\n\u003cp\u003eWhat have been your experiences in \"learning to hear\"? How do youÂ know if you've \"heard\"?\u003c\/p\u003e\n\u003cp\u003eHere's a gif of a cat listening:\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cimg alt=\"cat listening\" src=\"https:\/\/media.giphy.com\/media\/xUA7aRu3jonJ1W5S4o\/source.gif\" width=\"350\" style=\"float: none;\"\u003e\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-27T17:54:00-06:00","updated_at":"2020-08-27T17:54:39-06:00","summary_html":"\u003cp\u003e\"Learning how to hear\" is one of the desired outcomes of the mind training aspect of the Course.\u003c\/p\u003e\n\u003cp\u003eItÂ also rings of the \"period of sorting out\" mentioned in\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"http:\/\/cocreatingclarity.org\/JCIM5\/findL.php?B=M:\u0026amp;P=4.6\u0026amp;term=sorting%20out\u0026amp;I=7\" target=\"_blank\" title=\"manual for teachers section 4 paragraph 6\" rel=\"noopener noreferrer\"\u003eManual for Teachers section 4\u003c\/a\u003eÂ where the outcome is \"\u003cspan\u003eunderstanding that all things, events, encounters, and circumstances are helpful. It is only to the extent to which they are helpful that any degree of reality should be accorded them in this world of illusion.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003eHowÂ \u003c\/em\u003ethese \"heard\" messages are conveyed and receivedÂ is perhaps an individualized process, but I thought I'd share some learnings I've gained while \"learning to hear.\"\u003c\/p\u003e","template_suffix":null,"handle":"learning-to-hear","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384834142243","image":{"created_at":"2020-08-27T17:54:39-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_b809e74c-ba33-4fbd-9406-032a94b82e24.png?v=1598572479"}},{"id":384813858851,"title":"Where am I? - A Meditation Technique","created_at":"2020-08-23T19:03:32-06:00","body_html":"\u003cp\u003e\u003cstrong\u003ealex brady loves mind training. Meditative sessions are an arena for testing the strength of a mind's Focus, Attention, Imagination, and Openness.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eThis is simple meditation technique that uses inner body awareness and confused senses to break us from our daily identity.\u003c\/p\u003e\n\u003cp\u003eIt is intended to help the person become aware of sensations and mental abilities often quieted and silenced by theÂ activities of day-to-day life.Â \u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThis technique is good for practicing:\u003c\/span\u003e\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eAttention\u003c\/li\u003e\n\u003cli\u003eOpen-mindedness\u003c\/li\u003e\n\u003cli\u003eImagination\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cstrong\u003eQuiet your senses.\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eClose your eyes. Become comfortable with your surroundings. Change any sound, smell, or sensation within reason until you are comfortable.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCool down.\u003c\/strong\u003e\u003cbr\u003e\n\u003cp\u003e\u003cspan\u003eRecommended time: 5 minutes. Do what every cool down works for you. A simple watching of your breath for the duration is good. The goal is to come to a sense of stillness.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUnderstand your body's position\u003c\/strong\u003e\u003cbr\u003e\n\u003cp\u003e\u003cspan\u003eUsing \u003ca href=\"https:\/\/en.wikipedia.org\/wiki\/Proprioception\" target=\"_blank\" title=\"Proprioception\" rel=\"noopener noreferrer\"\u003eproprioception\u003c\/a\u003e, the sense of body position, determine where your toes, hands, head, and everything in between are. Now feel the full field of you perception of your position. It may feel tingly, soft, electric, or many other.. This is what I will call \"inner body perception.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003eThink of a time and place where you were in the exact or similar body position. The further away in space or time from your current experience you imagine, the more useful you will find this exercise.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou are in that other place now.\u003c\/strong\u003e\n\u003cp\u003eCan you convince yourself that you are in that other time and space? Any remaining sensory noises will be the only remaining connection to the space and time your body is in. Mentally, remove those noises from your awareness or accept them completely.\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eTip: Focus on your inner body.\u003c\/strong\u003e See Step 3.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eStay like this.\u003c\/strong\u003e\u003cbr\u003e\n\u003cp\u003e\u003cspan\u003eMaintain focus on your inner body, shunning the outside world. Who cares where you are in space? Not you. Not for the duration of this exercise.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003eUnlike some other meditation techniques, do not allow your mind to wander or contemplate for some time. Here is a Focus Exercise. If you begin to slip into mind wandering, recall your attention to your inner body and your sense of stillness. Do not be disheartened if your mind wander, be heartened that you are able to recall your attention.\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eContemplate and return to body\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eDuring the last phase of meditation, you may notice your mental muscles tiring. Allow your senses back to your awareness. Begin thinking kind thoughts: thoughts of truth, ACIM workbook lessons, personal affirmations, etc.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eWhen you are ready, open your eyes, appreciate your surroundings, and return to your regular activities.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003chr style=\"margin: 3em 0;\"\u003e\n\u003cp\u003eThis meditation is a clear invitation and practice in inviting your awareness to considerÂ \u003cstrong\u003emind\u003c\/strong\u003e \u003cstrong\u003eidentity\u003c\/strong\u003eÂ rather thanÂ body identity. Can you feel the difference? Are you even here?\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cem\u003e\u003cstrong\u003eI am mind.\u003c\/strong\u003e\u003c\/em\u003e \u003cem\u003e\u003cstrong\u003eI am spirit.\u003c\/strong\u003e\u003c\/em\u003e \u003cem\u003e\u003cstrong\u003eI am not a body.\u003c\/strong\u003e\u003c\/em\u003e \u003cem\u003e\u003cstrong\u003eI am free. \u003cspan style=\"color: white;\"\u003eI am as God created me.\u003c\/span\u003e\u003c\/strong\u003e\u003c\/em\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eStay awakening.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-23T19:03:00-06:00","updated_at":"2020-08-23T19:03:32-06:00","summary_html":"\u003cp\u003eThis is simple meditation technique that uses inner body awareness and confused senses to break us from our daily identity.\u003c\/p\u003e\n\u003cp\u003eIt is intended to help the person become aware of sensations and mental abilities often quieted and silenced by theÂ activities\u003cspan\u003eÂ \u003c\/span\u003eof day-to-day life.Â \u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThis meditation is a clear invitation and practice in inviting you to considerÂ \u003c\/span\u003e\u003cstrong\u003emind\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003eidentity\u003c\/strong\u003e\u003cspan\u003eÂ rather thanÂ body identity. Can you feel the difference? Are you even here?\u003c\/span\u003e\u003c\/p\u003e","template_suffix":null,"handle":"where-am-i-a-meditation-technique","tags":"meditation technique","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384813858851","image":{"created_at":"2020-08-23T19:03:32-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_2c8832b7-4605-45ad-b84d-da9b278618ef.png?v=1598231012"}},{"id":384813793315,"title":"\"Only my condemnation..\"","created_at":"2020-08-23T17:53:58-06:00","body_html":"\u003ch1\u003e\u003cstrong\u003eOnly my condemnation injures me.\u003c\/strong\u003e\u003c\/h1\u003e\n\u003cp\u003e\u003cstrong\u003e~ ACIM \u003ca href=\"https:\/\/acourseinmiraclesnow.com\/a-course-in-miracles-workbook-lesson-198\/\" target=\"_blank\" title=\"acim workbook lesson 198\" rel=\"noopener noreferrer\"\u003eLesson 198\u003c\/a\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eI like this lesson for the straightforward approach at establishing where the cause of injury is -- our mind. I find myself using it anytime I feel inclined to indulge in fear, grief, or pain. \"The way I'mÂ perceiving this is the cause of my problems.\"\u003c\/p\u003e\n\u003cp\u003eThere are other understandings that can be gleaned from the lesson title. Can you see the different meanings that are conveyed by different emphasis and verbal patterns?\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003e\u003cstrong\u003eDifferent emphases:\u003c\/strong\u003e\u003c\/h3\u003e\n\u003cp\u003e\u003cstrong\u003eOnly\u003c\/strong\u003e my condemnation injures me.\u003c\/p\u003e\n\u003cp\u003eOnly \u003cstrong\u003emy\u003c\/strong\u003e condemnation injures me.\u003c\/p\u003e\n\u003cp\u003eOnly my \u003cstrong\u003econdemnation\u003c\/strong\u003e injures me.\u003c\/p\u003e\n\u003cp\u003eOnly \u003cstrong\u003emy condemnation\u003c\/strong\u003e injures me.\u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003eOnly my condemnation\u003c\/strong\u003e injures me.\u003c\/p\u003e\n\u003cp\u003eOnly my condemnation injures \u003cstrong\u003eme.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003eAdded punctuation:\u003c\/h3\u003e\n\u003cp\u003eOnly, my condemnation injures me. (My condemnation injures me only.)\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eMy condemnation \u003cstrong\u003einjures\u003c\/strong\u003e me only.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eMy condemnation injures \u003cstrong\u003eme only.\u003c\/strong\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003e\u003cspan\u003e\u003cstrong\u003eJust for fun:\u003c\/strong\u003e\u003c\/span\u003e\u003c\/h3\u003e\n\u003cp\u003e\u003cspan\u003eOnly, my condemnation, injures me. (My condemnation's name is Only.)\u003c\/span\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cimg alt=\"only my condemnation injures me\" src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/only_injures_me_large.png?v=1598226527\" style=\"float: none; margin-top: 3em; margin-bottom: 3em;\"\u003e\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eLesson 198: Only my condemnation injures me.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/acourseinmiraclesnow.com\/a-course-in-miracles-workbook-lesson-198\/\" target=\"_blank\" title=\"lesson 198: only my condemnation injures me\" rel=\"noopener noreferrer\"\u003eRead full lesson here\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eWhat other ways do you see this lesson?\u003c\/p\u003e\n\u003cp\u003eStay humble. Stay open-minded.Â \u003cspan\u003eðŸ•Šï¸\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-23T17:50:00-06:00","updated_at":"2020-08-23T18:05:20-06:00","summary_html":"\u003cp\u003e\"Only my condemnation injures me.\": a straightforward approach at establishing where the cause of injury is -- our mind. I find myself using it anytime I feel inclined to indulge in fear, grief, or pain. \"The way I'mÂ perceiving\u003cspan\u003eÂ \u003c\/span\u003ethis is the cause of my problems.\"\u003c\/p\u003e\n\u003cp\u003eYet, there are other understandings that can be gleaned from the lesson title. Can you see the different meanings that are conveyed by different emphasis and verbal patterns?\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e","template_suffix":null,"handle":"only-my-condemnation","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384813793315","image":{"created_at":"2020-08-23T17:53:58-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_dc9f7d4f-dd55-46ea-9226-1939d4f4d5ee.png?v=1598226838"}},{"id":384705429539,"title":"the game of alex brady","created_at":"2020-08-05T16:28:09-06:00","body_html":"\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003ealex brady is the game that you can always win. Or are you such a loser that you canâ€™t win? What a noob. (get this hat though)\u003c\/span\u003e\u003c\/p\u003e\n\u003ch3\u003e\u003cb\u003eSetup\u003c\/b\u003e\u003c\/h3\u003e\n\u003cp\u003e\u003cb\u003eNumber of players needed:\u003c\/b\u003e\u003cspan style=\"font-weight: 400;\"\u003e 1, the entire world\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eTime required:\u003c\/b\u003e\u003cspan style=\"font-weight: 400;\"\u003e your lifetime\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cb\u003eMaterials needed:\u003c\/b\u003e\u003c\/p\u003e\n\u003cul\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eOne mind\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eA little willingness\u003c\/span\u003e\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003c\/p\u003e\n\u003ch3\u003e\u003cb\u003eHow To Play\u003c\/b\u003e\u003c\/h3\u003e\n\u003col\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\n\u003cspan style=\"font-weight: 400;\"\u003eEveryone in the world is playing the alex brady game. \u003c\/span\u003e\u003cspan style=\"font-weight: 400;\"\u003eA person cannot refuse to play the alex brady game; it does not require consent to play and one can never stop playing.\u003c\/span\u003e\n\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eWhenever you think about the alex brady game, you Win.Â \u003cspan\u003eðŸ†\u003c\/span\u003eÂ \u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/doge_outline_pico.png?v=1596677101\" alt=\"doge wow\"\u003e\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eAll wins must be announced. This should be done as loud as possible\/desired and with such phrases as\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"list-style: none;\"\u003e\n\u003cul\u003e\n\u003cli\u003e\"I just Won the game\"\u003c\/li\u003e\n\u003cli\u003eâ€œI am alex bradyâ€\u003c\/li\u003e\n\u003cli\u003e\"a.b always wins\"\u003c\/li\u003e\n\u003cli\u003e( Í¡Â° ÍœÊ– Í¡Â°) \u003cspan style=\"color: #ffffff;\"\u003e(\"i just came\")\u003c\/span\u003e\n\u003c\/li\u003e\n\u003cli\u003eâ€œBuffalo buffalo buffalo buffalo Buffalo buffalo buffalo!â€\u003c\/li\u003e\n\u003cli\u003eanyÂ  Â  Â  Â  Â thing works\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cbr\u003e\n\u003ch3\u003e\u003cb\u003eAdditional Rules\u003c\/b\u003e\u003c\/h3\u003e\n\u003cul\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eIf when a win is announced, another mind wins due to remembering alex brady game, the original winner gets a point\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eIf the secondary announced win caused even another mind to win, BOTH upstream people get a point\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eAnd so on, and so on...\u003c\/span\u003e\u003c\/li\u003e\n\u003cli style=\"font-weight: 400;\"\u003e\u003cspan style=\"font-weight: 400;\"\u003eThe points donâ€™t matter, but DOÂ keep count!\u003c\/span\u003e\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eÂ \u003c\/span\u003e\u003c\/p\u003e\n\u003ch3\u003e\u003cb\u003eHow the Game Ends\u003c\/b\u003e\u003c\/h3\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eâ€œThe game is upâ€.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003egood luck. have fun. stay live.\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eP.S. - get this hat too\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-05T17:13:00-06:00","updated_at":"2020-09-30T01:11:55-06:00","summary_html":"\u003cp\u003e\u003cstrong\u003eThe First Rule\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e1. Everyone in the world is playing the alex brady game.Â A person cannot refuse to play the alex brady game; it does not require consent to play and one can never stop playing.\u003c\/p\u003e\n\u003cp\u003eReady to start winning?\u003c\/p\u003e","template_suffix":"","handle":"the-game-of-alex-brady","tags":"game","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384705429539","image":{"created_at":"2020-08-05T17:06:09-06:00","alt":"","width":1250,"height":1262,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_games_logo.png?v=1596668769"}},{"id":384687276067,"title":"Presence watching Workaholics","created_at":"2020-08-01T18:48:03-06:00","body_html":"\u003cp\u003eIt's no secret: I enjoy the show Workaholics. I like the irreverent humor. I like how all the characters have consistent flaws. I like that they do drugs and slack-off.\u003c\/p\u003e\n\u003cp\u003eBecause of my passion for the show, many of my learning opportunities come from scenes in that show. I don't watch it much these days on TV, but certain scenes do comeÂ to me regularly. This scene in particular comes up when I am feeling restless, excited, or anxious:\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ciframe width=\"560\" height=\"315\" src=\"https:\/\/www.youtube-nocookie.com\/embed\/ML_yKt_SzvI?start=23\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"\u003e\u003c\/iframe\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eMoral of the story:\u003c\/p\u003e\n\u003cp style=\"font-size: 1.5em;\"\u003e\u003cstrong\u003eIt is going to happen.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eNo impatience makes it faster. No resistance can prevent it. It's a blessing and a sentence.Â \u003cspan style=\"color: #fff;\"\u003ecan also be read as \"it's: a blessing and a sentence.\"\u003c\/span\u003e\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003eWhat exactly is\u003cstrong\u003e it \u003c\/strong\u003e that's unpreventable?\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe end\u003c\/li\u003e\n\u003cli\u003ethe next\u003c\/li\u003e\n\u003cli\u003etheÂ awakening\u003c\/li\u003e\n\u003cli\u003ethe atonement\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eHow about you?\u003c\/p\u003e\n\u003cp\u003eWhat lessons in this clip speak to you?\u003c\/p\u003e\n\u003cp\u003eWhat is\u003cstrong\u003e it\u003c\/strong\u003e to you?\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-08-01T18:51:00-06:00","updated_at":"2020-08-01T18:55:21-06:00","summary_html":"\u003cp\u003eIt's no secret: I enjoy the show Workaholics. Because of my passion for the show, many of my learning opportunities come from its scenes.Â This particular opening has a common lesson for me. Lesson inside.\u003c\/p\u003e","template_suffix":null,"handle":"presence-watching-workaholics","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384687276067","image":{"created_at":"2020-08-01T18:48:03-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_c95c17cd-5d0f-438a-b5d0-2d0eb48125ae.png?v=1596329283"}},{"id":384685703203,"title":"a.b reinterprets Darth Plagueis","created_at":"2020-07-31T19:47:31-06:00","body_html":"\u003cp\u003eI came across a quote recently that reminded me of how the Spirit speaks. The only problem is... \u003cem\u003e\u003cstrong\u003eit's completely backwards.\u003c\/strong\u003e\u003c\/em\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003e\u003c\/em\u003eThe quote is attributed to a Star Wars character, Darth Plagiueis, a Sith. I don't knowÂ \u003cem\u003emuch\u003c\/em\u003e about Star Wars, but Siths come across as quintessential anti-good guys.\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cimg src=\"https:\/\/comicbookandbeyond.com\/wp-content\/uploads\/2019\/06\/Sith-best-quotes-790x420.jpg\" alt=\"sith quote: It all depends on your definition of good, doesnâ€™t it?\"\u003e\u003c\/p\u003e\n\u003ch2\u003eThe good stuff\u003c\/h2\u003e\n\u003cp style=\"color: gray; font-size: .8em; margin-top: -1em;\"\u003ewell.....the \"good\" stuff\u003c\/p\u003e\n\u003cp\u003eHere's the quote:\u003c\/p\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003eTell me what you regard as your greatest strength, so I will know how best to undermine you;\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003etell me of your greatest fear, so I will know which I must force you to face;\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003etell me what you cherish most, so I will know what to take from you;\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003eand tell me what you crave, so that I might deny youâ€¦\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cstrong\u003eDarth Plagueis\u003c\/strong\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003ecool. coolcoolcool...\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003cimg src=\"https:\/\/media.giphy.com\/media\/Yo7cLnFAHLgbp6SA5V\/giphy.gif\" alt=\"\"\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003eHere it is as a.b sees it:\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003eTell me what you regard as your greatest strength, so \u003cstrong\u003eI will know how best to pump you up\u003c\/strong\u003e; tell me of your greatest fear, so \u003cstrong\u003eI will know which I mustÂ show you is unreal\u003c\/strong\u003e; tell me what you cherish most, so \u003cstrong\u003eI will know of what to remind you when you're dow\u003c\/strong\u003en; and tell me what you crave, so that\u003cstrong\u003e I can give you all of it.\u003c\/strong\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003ealex \"a.b\" brady\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003ei like those words better. reason: it sounds like love and unity and power and peace. #abthings\u003c\/span\u003e\u003c\/div\u003e\n\u003c\/div\u003e\n\u003chr\u003e\n\u003ch3\u003eNote of interest\u003c\/h3\u003e\n\u003cp\u003eWhile the quote is attributed to a fictional character, the words themselves had to have been written by a human \u003cem\u003e(most likely)\u003c\/em\u003e. A human with a mind like our own (perhaps reading these words -- hello!) in communication at all times with universal oneness.\u003c\/p\u003e\n\u003cp\u003eThat's pretty cool, huh. I wonder if they were first hit with the lovely thoughts, then adapted them to the Sith motif.\u003c\/p\u003e\n\u003cp\u003eThese words as written are beautiful despite, no, \u003cem\u003ebecause of\u003c\/em\u003e their form for the truth they allow us to uncover.\u003c\/p\u003e\n\u003cp\u003ethanks and keep thinking! (keep thinking selfully)\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cp\u003ePS -Â \u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/starwars.fandom.com\/wiki\/Darth_Plagueis\/Legends\" target=\"_blank\" title=\"darth plagueis video\" rel=\"noopener noreferrer\"\u003e1 minuteÂ Darth PlagueisÂ (fandom.com)\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/comicbookandbeyond.com\/sith-quotes\/\" target=\"_blank\" title=\"cbb sith quotes\" rel=\"noopener noreferrer\"\u003esith quotes (comicbookandbeyond.com)\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/www.hulu.com\/series\/brooklyn-nine-nine-daf48b7a-6cd7-4ef6-b639-a4811ec95232\" target=\"_blank\" title=\"brooklyn 99 series page hulu\" rel=\"noopener noreferrer\"\u003ebrooklyn 99 (hulu.com)\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003e\u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_fip_ed1.pdf?v=1594679192\" target=\"_blank\" title=\"acim full pdf online\" rel=\"noopener noreferrer\"\u003eA Course in Miracles\u003c\/a\u003eÂ \u003c\/em\u003e(full pdf)\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-31T20:00:00-06:00","updated_at":"2020-07-31T20:09:21-06:00","summary_html":"\u003cp\u003eI came across a quote recently that reminded me of how the Spirit speaks. The only problem is... it's completely backwards.\u003c\/p\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\"Tell me what you regard as your greatest strength, so I will know how best to undermine you;\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003cspan\u003etell me of your greatest fear, so I will know which I must force you to face.\"\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003e\u003c\/span\u003e\u003c\/div\u003e\n\u003cdiv style=\"text-align: left;\"\u003e\u003cspan\u003ehow does a.b see this? hint: more peacefully\u003c\/span\u003e\u003c\/div\u003e","template_suffix":null,"handle":"a-b-reinterprets-darth-plagueis","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384685703203","image":{"created_at":"2020-07-31T20:00:35-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_069ebdb2-cbc2-4632-9b2f-ae039098ec64.png?v=1596247235"}},{"id":384657096739,"title":"Remember Nothing - Meditation Technique","created_at":"2020-07-25T17:38:52-06:00","body_html":"\u003cp\u003e\u003cspan\u003eL-189. Simply do this: Be still, and lay aside all thoughts of what you are and what God is; all concepts you have learned about the world; all images you hold about yourself. Empty your mind of everything it thinks is either true or false, or good or bad, of every thought it judges worthy, and all the ideas of which it is ashamed. Hold onto nothing. Do not bring with you one thought the past has taught, nor one belief you ever learned before from anything.Â \u003c\/span\u003e\u003cstrong class=\"_12FoOEddL7j_RgMQN0SNeU\"\u003eForget this world, forget this course, and come with wholly empty hands unto your God.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cstrong class=\"_12FoOEddL7j_RgMQN0SNeU\"\u003etbc\u003c\/strong\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":null,"updated_at":"2020-07-25T17:39:24-06:00","summary_html":"","template_suffix":null,"handle":"remember-nothing-meditation-technique","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384657096739","image":{"created_at":"2020-07-25T17:39:24-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_4f7c3541-fbc8-4f65-8281-36bcf35c39ea.png?v=1595720364"}},{"id":384656539683,"title":"Active Listening - A Meditation Technique","created_at":"2020-07-25T15:16:58-06:00","body_html":"\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e\u003c\/span\u003e\u003cstrong\u003ealex brady loves mind training. Meditative sessions are an arena for testing the strength of a mind's Focus, Attention, Imagination, and Openness. \u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eWhile other meditative techniques may call for a full and sustained quieting of the mind, this particular meditative technique involves actively seeking out and listening to our inner intuition. While at first the mind is quiet, by the end we are seeking out our reasonable thoughts.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eThis technique is good for practicing:\u003c\/span\u003e\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eFocus\u003c\/li\u003e\n\u003cli\u003eOpen-mindedness\u003c\/li\u003e\n\u003cli\u003ePatience\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eA simple meditation technique that uses active listening to come to inner understandings.\u003c\/span\u003e\u003c\/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cstrong\u003eState your intention for meditation either internally or out loud.\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eIf you are coming to meditation wishing to find comfort from a difficult life experience, you may state your intention as follows:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan\u003eexample: â€œI need help seeing peace in this experience.â€\u003c\/span\u003e\u003c\/i\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eIf you are practicing with the Course in Miracles workbook, you may state the idea of the day:\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan\u003eexample: â€œI trust my brothers who are one with me.â€\u003c\/span\u003e\u003c\/i\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eAny time you hear your intention during meditation, remember your role in this exercise is to listen.\u003cbr\u003e\u003cbr\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eQuiet your senses.\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eBecome comfortable with your surroundings. Change any sound, smell, or sensation within reason until you are comfortable.\u003cbr\u003e\u003cbr\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eRestate your intention internally.\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eOnce you are comfortable, repeat your intention.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eIf at any point you notice that your mind has wandered unnecessarily, restate your intention.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eRepeat your intention and remember your role is to listen.\u003cbr\u003e\u003cbr\u003e\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cspan\u003e\u003cspan\u003e\u003cstrong\u003eActively watch your attention.\u003c\/strong\u003e\u003cbr\u003e\u003c\/span\u003e\u003c\/span\u003eWhen you notice something has captured your attention, ask â€œHow can this help my understanding?â€ The object of attention can be anything, a sound, a smell, or series of thoughts.\u003cbr\u003e\u003cbr\u003eYour attention being captured is important. Ask how this particular object of attention is important.\u003cbr\u003e\u003cbr\u003eRepeat your intention and remember your role is to listen.\u003cbr\u003e\u003cbr\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eFocus on one particular object.\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eAt a point in the exercise, there will be an object of attention that engages you more so than the others. When you notice this increased attention, ask one final time:Â \u003c\/span\u003e\u003ci\u003e\u003cspan\u003eâ€œHow can this help my understanding?â€\u003c\/span\u003e\u003c\/i\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eRepeat your intention and remember your role is to listen.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUnderstanding\u003c\/strong\u003e\n\u003cp\u003e\u003cspan\u003eLet your reasonable mind speak to you from the silence. Let your intuition speak to you from the silence. The understanding will be gentle and joyful. The understanding will remind you of strength and love. There will be a familiarity to the understanding.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eSometimes the only understanding is that underneath all appearances, there is peace. We can experience that peace when we want, when we ask.\u003c\/span\u003e\u003c\/p\u003e\n\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003eThis meditative technique is a daily go to for me. I hope you learn something from yourself!\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eStay awakening.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-25T15:16:00-06:00","updated_at":"2020-07-25T15:17:54-06:00","summary_html":"alex brady loves mind training. Meditative sessions are an arena for testing the strength of a mind's Focus, Attention, Imagination, and Openness.\u003cbr\u003e\u003cbr\u003eThis particular meditative technique involves actively seeking out and listening to our inner intuition.","template_suffix":null,"handle":"active-listening-a-meditation-technique","tags":"meditation technique","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384656539683","image":{"created_at":"2020-07-25T15:16:58-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light_b9cef6eb-af15-480e-be6a-ffc5d537936d.png?v=1595711818"}},{"id":384653230115,"title":"Spirit Sweats","created_at":"2020-07-24T11:58:47-06:00","body_html":"\u003cp\u003eThis group is about empowering your mental strength.\u003c\/p\u003e\n\u003cp\u003eThe methods used are:\u003c\/p\u003e\n\u003cp\u003e* quiet contemplation\u003c\/p\u003e\n\u003cp\u003e* memoryÂ practice\u003c\/p\u003e\n\u003cp\u003e* attention practice\u003c\/p\u003e\n\u003cp\u003e* community and focused conversation\u003c\/p\u003e\n\u003cp\u003e* etc.\u003c\/p\u003e\n\u003cp\u003eOur community stands by the following standards:\u003cbr\u003eShowing up on time - being present\u003cbr\u003eSupporting the group - being focused\u003cbr\u003eSharing openly - providing honest feedback\u003cbr\u003eSkipping negative criticism - that may slow progress\u003cbr\u003eStaying positive - building trust\u003cbr\u003eSmiling\u003c\/p\u003e","blog_id":50202673187,"author":"Popular Demand Collaborator","user_id":null,"published_at":null,"updated_at":"2020-07-24T11:59:26-06:00","summary_html":"","template_suffix":null,"handle":"spirit-sweats","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384653230115"},{"id":384644743203,"title":"Remember Mr. Rogers? Watch his movie.","created_at":"2020-07-22T23:18:31-06:00","body_html":"\u003cp\u003eTL;DR: Go watch \"Won't You Be My Neighbor\" the Mister Rogers documentaryÂ \u003ca href=\"https:\/\/www.hbo.com\/documentaries\/wont-you-be-my-neighbor\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e(HBO)\u003c\/a\u003e \u003ca href=\"https:\/\/www.amazon.com\/Wont-You-Be-My-Neighbor\/dp\/B07FCQ2T9K\" title=\"amazon prime wont you be my neighbor\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e(Amazon)\u003c\/a\u003eÂ \u003ca href=\"https:\/\/www.google.com\/search?q=wont%20you%20be%20my%20neighbor\" target=\"_blank\" title=\"gogole search wybmn\" rel=\"noopener noreferrer\"\u003e(Google)\u003c\/a\u003e. There is a real life miracle in the film. \u003ca href=\"https:\/\/iamalexbrady.com\/products\/miracles-seen-flat-bill\" target=\"_blank\" title=\"miracles: seen flat bill\" rel=\"noopener noreferrer\"\u003eBuy this hatÂ \u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003e===\u003c\/p\u003e\n\u003ch2\u003eFred Rogers is a Modern Saint\u003c\/h2\u003e\n\u003cp\u003eFred Rogers:\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eMogul\u003c\/li\u003e\n\u003cli\u003eMinister\u003c\/li\u003e\n\u003cli\u003eMister Rogers\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eDude in the cardigan. Won the Ultimate Showdown.\u003c\/p\u003e\n\u003cp\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/Fred_Rogers_Changing_Shoes_large.jpg?v=1595480119\" alt=\"mr rogers changing shoes\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center; margin-top: -.5em; color: #ababab;\"\u003esick skills\u003c\/p\u003e\n\u003cp\u003eWhether or not you were able to watch his show while it aired, chances are you have heard his message.\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003e\u003cem\u003eâ€œThere are three ways to ultimate success:\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe first way is to be kind.\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe second way is to be kind.\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe third way is to be kind.â€\u003c\/em\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center;\"\u003eFred \"a.b\" Rogers\u003c\/p\u003e\n\u003cp\u003eMr. Rogers was on some next level ship. He was riding a wave of inspiration like few in the world have ridden.\u003c\/p\u003e\n\u003cp\u003eWatching the documentary of his life is one way to see what the type of love that extends beyond theÂ self looks like -- in this case, beyond Fred Rogers.\u003c\/p\u003e\n\u003cp\u003eWatch the way he observes. Pure presence.\u003c\/p\u003e\n\u003cp\u003eWatch the way he considers others. Pure presence.\u003c\/p\u003e\n\u003cp\u003eWatch the way he talks to kids. Purely \u003cstrong\u003e\u003cem\u003eright there\u003c\/em\u003e\u003cem\u003e.\u003c\/em\u003e\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003eHonestly, it's kind of weird. But maybe it's only weird because we don't see that type of behavior often. That type of careful consideration. Mr. Rogers' message surely provided an uplift to the lives of those it touched in an uncommon way, surely uncommon behavior comes with the territory.\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003eThere is also an interesting case for a miracle in the movie. It is filmed and on screen for all to see. \u003cstrong\u003eComment below if you catch it!\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/products\/miracles-seen-flat-bill\" target=\"_blank\" title=\"miracles seen flat bill cap\" rel=\"noopener noreferrer\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/miracles_seen_hat_large.jpg?v=1595480809\" alt=\"miracles: seen hat\" width=\"243\" height=\"243\" style=\"display: block; margin-left: auto; margin-right: auto;\"\u003e\u003c\/a\u003e\u003c\/p\u003e\n\u003cp style=\"text-align: center; margin-top: -.5em; color: #ababab;\"\u003e\u003ca href=\"https:\/\/iamalexbrady.com\/products\/miracles-seen-flat-bill\" target=\"_blank\" title=\"miracles seen flat bill cap\" rel=\"noopener noreferrer\"\u003ethen buy this hat\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eIf you'd like to watch a life of modern inspirationÂ \u003cem\u003e\u003cstrong\u003eGo Watch \"Won't You Be My Neighbor\"\u003c\/strong\u003e\u003c\/em\u003e.Â \u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"https:\/\/www.hbo.com\/documentaries\/wont-you-be-my-neighbor\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e(HBO)\u003c\/a\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"https:\/\/www.amazon.com\/Wont-You-Be-My-Neighbor\/dp\/B07FCQ2T9K\" title=\"amazon prime wont you be my neighbor\" target=\"_blank\" rel=\"noopener noreferrer\"\u003e(Amazon)\u003c\/a\u003e\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"https:\/\/www.google.com\/search?q=wont%20you%20be%20my%20neighbor\" target=\"_blank\" title=\"gogole search wybmn\" rel=\"noopener noreferrer\"\u003e(Google)\u003c\/a\u003e\u003c\/p\u003e\n\u003cp\u003eThen go be Mister Rogers weird. Permission granted.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-22T23:34:00-06:00","updated_at":"2020-07-31T20:11:35-06:00","summary_html":"\u003cp\u003eTL;DR - there's a miracle in the movie, check it out\u003c\/p\u003e\n\u003cp\u003eWhether or not you were able to watch his show while it aired, chances are you have heard his message.\u003c\/p\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\n\u003cem\u003eâ€œThere are three ways to ultimate success:\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe first way is to be kind.\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe second way is to be kind.\u003c\/em\u003e\u003cbr\u003e\u003cem\u003eThe third way is to be kind.â€\u003c\/em\u003e\n\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003eFred Rogers\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003e\u003c\/div\u003e\n\u003cp\u003e\u003cspan\u003eWatching the documentary of his life is one way to see what the type of love that extends beyond theÂ self looks like -- in this case Fred Rogers.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":null,"handle":"remember-mr-rogers-watch-his-movie","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384644743203","image":{"created_at":"2020-07-23T00:16:20-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently.png?v=1595484980"}},{"id":384616431651,"title":"faith check: \"God goes with me wherever I go.\"","created_at":"2020-07-16T11:50:13-06:00","body_html":"\u003ch3 class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eGod goes with me wherever I go.\u003c\/h3\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003ethis is from \u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_fip_ed1.pdf?v=1594679192#page=179\" title=\"acim workbook 41\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eA Course in Miracles\u003c\/span\u003e workbook lesson 41\u003c\/a\u003e. please take note:\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center;\"\u003e\"You can never be deprived of your perfect holiness because its Source goes with you wherever you go. You can never suffer because the Source of all joy goes with you wherever you go. You can never be alone because the Source of all life goes with you wherever you go. Nothing can destroy your peace of mind because God goes with you wherever you go.\"\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: left;\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: left;\"\u003eif that's what it means to go with God,Â sign me up! right?\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003e\u003ca href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/acim_fip_ed1.pdf?v=1594679192#page=179\" class=\"_3t5uN8xUmg0TOwRCOGQEcU\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\" title=\"acim lesson 41\"\u003eHere's paragraph 5:\u003c\/a\u003e\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center;\"\u003e\"\u003cstrong class=\"_12FoOEddL7j_RgMQN0SNeU\"\u003eWe understand that you do not believe all this.\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003eHow could you, when the truth is hidden deep within, under a heavy cloud of insane thoughts, dense and obscuring, yet representing all you see? Today we will make our first real attempt to get past this dark and heavy cloud, and to go through it to the light beyond.\"\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center;\"\u003eÂ \u003c\/p\u003e\n\u003cp\u003ethanks Holy Spirit....i can try to believe though, right? heres a cool math trick that works for me:\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003ea)Â \u003cstrong\u003e\"My mind is a part of God's. I am very holy.\"\u003c\/strong\u003e because obviouslyÂ \u003cspan\u003eðŸ˜‡\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eb) \u003cstrong\u003emy mind goes with me wherever I go.\u003c\/strong\u003e once again, obviously\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003ea + b = part of God's mind goes with me wherever I go =\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003ec)Â \u003cstrong\u003eGod must be with me.\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eÂ \u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eone truth understood and believed.\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eÂ \u003c\/p\u003e\n\u003cdiv class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center;\"\u003eand when no belief\u003c\/div\u003e\n\u003cdiv class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center;\"\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/peter_walking_on_water_allesandro_allori_by_ab_medium.jpg?v=1594921439\" alt=\"peter walking on water by alessandro allori cropped by a.b\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"_1qeIAgB0cPwnLhDF9XSiJM\" style=\"text-align: center; font-size: .5em; color: gray; margin-bottom: .5em;\"\u003epeter walking on water by alessandro \"a.b\" allori\u003c\/div\u003e\n\u003cdiv style=\"text-align: center;\"\u003ei try faith\u003c\/div\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003ewhat works for you? leave a comment and \u003ca href=\"https:\/\/www.reddit.com\/r\/ACIM\/comments\/hsd4n1\/this_is_the_truth_god_goes_with_me_wherever_i_go\/\" target=\"_blank\" title=\"similar r\/acim post\" rel=\"noopener noreferrer\"\u003ejoin me on reddit\u003c\/a\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-16T11:51:00-06:00","updated_at":"2020-07-16T12:00:51-06:00","summary_html":"\u003cspan\u003eLesson 41: You can never suffer because the Source of all joy goes with you wherever you go. You can never be alone because the Source of all life goes with you wherever you go. Nothing can destroy your peace of mind because God goes with you wherever you go.\u003c\/span\u003e","template_suffix":null,"handle":"faith-check-god-goes-with-me-wherever-i-go","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384616431651","image":{"created_at":"2020-07-16T11:59:53-06:00","alt":"","width":938,"height":938,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/reddit_logo_black_on_white_181c4880-2cec-438b-bcb9-6e443a923791.png?v=1594922393"}},{"id":384593854499,"title":"A gentle answer: \"It is not so.\"","created_at":"2020-07-12T00:39:18-06:00","body_html":"\u003cmeta charset=\"utf-8\"\u003e\u003cmeta charset=\"utf-8\"\u003e\n\u003ch2\u003e1.\u003c\/h2\u003e\n\u003cblockquote\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eOne walks with you Who gently answers all your fears with this one merciful reply, \"It is not so.\" He points to all the gifts you have each time the thought of poverty oppresses you, and speaks of His Companionship when you perceive yourself as lonely and afraid.\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=508\" title=\"acim pdf workbook 166\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eACIM Workbook Lesson 166\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003ch2\u003ealso 1.\u003c\/h2\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003evision\u003c\/strong\u003e\u003c\/p\u003e\nAn inward recognition of the holiness within all things, which overlooks bodies and their attacks. This perception comes not through our eyes but from a spiritual faculty in us called the eyes of Christ. Rather than seeing visual forms or color, it â€œseesâ€ pure meaning, the meaning of holiness.\u003c\/blockquote\u003e\n\u003cblockquote\u003e\u003ca href=\"http:\/\/www.miraclesinactionpress.com\/dthomp74\/2008\/TOOLBOX\/4b%20HLC%20e-text\/1%204b%20Whitmore%20OE.pdf#page=318\" target=\"_blank\" title=\"acim glossary of terms - vision\" rel=\"noopener noreferrer\"\u003eACIM Glossary of Course Terms\u003c\/a\u003e\u003c\/blockquote\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003ethese are the same\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-12T00:46:00-06:00","updated_at":"2020-07-13T02:25:59-06:00","summary_html":"He points to all the gifts you have each time the thought of poverty oppresses you, and speaks of His Companionship when you perceive yourself as lonely and afraid.","template_suffix":null,"handle":"a-gentle-answer-it-is-not-so","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384593854499","image":{"created_at":"2020-07-13T02:25:59-06:00","alt":"","width":1280,"height":1203,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/hand_pointing_light.png?v=1594628759"}},{"id":384567967779,"title":"Conversations with Presence","created_at":"2020-07-06T23:15:06-06:00","body_html":"\u003cp\u003eStay present and aware of your need to return to your inner helper in any instant. After you hand the moment to the Holy Spirit (inner guide, God, universal consciousness), it will work\u003cspan\u003eÂ \u003c\/span\u003e\u003cstrong\u003ethrough you\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003eto heal the situation. Your body\u003cspan\u003eÂ \u003c\/span\u003e\u003cem\u003ewill\u003c\/em\u003e\u003cspan\u003eÂ \u003c\/span\u003eact. It doesn't disappear, what else can happen..\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThe Holy Spirit must work through you to teach you he is in you. This is an intermediary step toward the knowledge that you are in God because you are part of him.\u003cspan\u003eÂ \u003c\/span\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=1587\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\"\u003e(Ch 7, Sec 4)\u003c\/a\u003e\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp\u003eMy favorite part about this quite is the second sentence recognizing that there are intermediate steps toward true knowledge.\u003c\/p\u003e\n\u003cp\u003eHere's the thing:Â If you have an \"argument\" and end up with a more whole and healthy relationship.That's love by human definition if nothing else. You stayed withÂ the calls for love and the holy spirit answered the calls with one another's love for each other.\u003c\/p\u003e\n\u003cp class=\"_1qeIAgB0cPwnLhDF9XSiJM\"\u003eEvery moment contains the potential for peace, love, and joy. That is one thing i get from lesson WB66 \u003cstrong\u003eMy happiness and my function are one:\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003ca href=\"http:\/\/stobblehouse.com\/text\/ACIM.pdf#page=238\" rel=\"nofollow ugc noopener noreferrer\" target=\"_blank\"\u003eWithin Lesson 66\u003c\/a\u003e:\u003c\/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e[...] God has given you your function. We have seen that there are only two parts of your mind. One is ruled by the ego, and is made up of illusions. The other is the home of the Holy Spirit, where truth abides. There are no other guides but these to choose between, and no other outcomes possible as a result of your choice but the fear that the ego always engenders, and the love that the Holy Spirit always offers to replace it.\u003c\/p\u003e\n\u003cp\u003eThus, it must be that your function is established by God through His Voice, or is made by the ego which you have made to replace Him. Which is true?\u003c\/p\u003e\n\u003c\/blockquote\u003e\n\u003cp style=\"font-size: .9em;\"\u003e\u003cem\u003e\u003ca href=\"https:\/\/www.reddit.com\/r\/ACIM\/comments\/ha9peo\/when_you_have_a_discussion_with_a_friend\/fv1tb33?utm_source=share\u0026amp;utm_medium=web2x\" title=\"reddit discussion\" target=\"_blank\" rel=\"noopener noreferrer\"\u003efrom a discussion on reddit, r\/acim\u003c\/a\u003e\u003c\/em\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-07-06T23:23:00-06:00","updated_at":"2020-07-06T23:24:36-06:00","summary_html":"\u003cspan\u003eIf you have an \"argument\" and end up with a more whole and healthy relationship.That's love by human definition if nothing else. You stayed withÂ the calls for love and the spirit answered the calls with one another's love for each other.\u003c\/span\u003e","template_suffix":null,"handle":"argument-with-presence","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384567967779","image":{"created_at":"2020-07-06T23:23:41-06:00","alt":"","width":938,"height":938,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/reddit_logo_black_on_white.png?v=1594099421"}},{"id":384219414563,"title":"I AM","created_at":"2020-05-16T08:43:57-06:00","body_html":"\u003cp\u003e\u003cb\u003e\u003c\/b\u003e\u003cspan style=\"font-weight: 400;\"\u003e(n.) the source of being. All else arises from being.\u003c\/span\u003e\u003c\/p\u003e\n\u003cbr\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003eEven the great creator could not create until creation arose from I AMâ€™s Being. From that Being, creation is formed. For that creation, a Creator is formed. From that Creator, all else is formed.\u003c\/span\u003e\u003c\/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cem\u003e\u003cspan style=\"font-weight: 400;\"\u003eWhen I say I AM,\u003c\/span\u003e\u003c\/em\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cspan style=\"font-weight: 400;\"\u003eI pay respects to the source of life,\u003c\/span\u003e\u003c\/em\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cem\u003e\u003cspan style=\"font-weight: 400;\"\u003ethe Being devoted to AM.\u003c\/span\u003e\u003c\/em\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan style=\"font-weight: 400;\"\u003e- alex brady\u003c\/span\u003e\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-05-16T08:43:00-06:00","updated_at":"2020-05-16T08:53:07-06:00","summary_html":"\u003cp\u003e\u003cstrong\u003eI AM\u003c\/strong\u003e\u003c\/p\u003e\n\u003cp\u003e\u003cspan\u003e(n.) the source of being. All else arises from being.\u003c\/span\u003e\u003c\/p\u003e","template_suffix":null,"handle":"i-am","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384219414563","image":{"created_at":"2020-05-16T08:51:58-06:00","alt":"","width":1094,"height":349,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/iam_outline_jose.png?v=1589640718"}},{"id":384184516643,"title":"A Cycle","created_at":"2020-05-13T01:30:39-06:00","body_html":"\u003cp\u003e\u003cimg src=\"\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/files\/a_cycle_1024x1024.png?v=1594628921\" alt=\"comic strip of a cycle of light and darkness\"\u003e\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eThis will pass.Â The next, too, willÂ pass.\u003c\/p\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-05-13T01:30:00-06:00","updated_at":"2020-08-01T18:57:11-06:00","summary_html":"\u003cp\u003eThis will pass.Â The next, too, willÂ pass. A comic perspective.\u003c\/p\u003e","template_suffix":null,"handle":"a-cycle","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384184516643","image":{"created_at":"2020-08-01T18:57:11-06:00","alt":"","width":1153,"height":1153,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_sees_things_differently_aef588e2-a8e5-48a7-b118-589bd2179b1b.png?v=1596329831"}},{"id":384180289571,"title":"Holy Quiz Survey #1","created_at":"2020-05-12T13:56:49-06:00","body_html":"\u003cstyle\u003e\u003c!--\nblockquote {\nborder-left: 1em solid black;\npadding-left: 2em;\n}\n--\u003e\u003c\/style\u003e\u003cspan style=\"color: #555555;\"\u003eSelect answers from select questions from The Only Holy Quiz.\u003c\/span\u003e\u003cbr\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eWhat is this?\u003c\/h2\u003e\n\u003cp\u003eEvery thing plus some extrasÂ  Â  Â - a.a\u003c\/p\u003e\n\u003cp\u003ethe only thing plus some extrasÂ  Â  Â - a.b\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eWhen is this?\u003c\/h2\u003e\n\u003cp\u003eEvery time plus some extrasÂ  Â  Â - a.a\u003c\/p\u003e\n\u003cp\u003ethe onlyÂ timeÂ plus some extrasÂ  Â  Â - a.b\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eWhere is this?\u003c\/h2\u003e\n\u003cp\u003eEvery place plus some extrasÂ  Â  Â - a.a\u003c\/p\u003e\n\u003cp\u003ethe only place plus some extrasÂ  Â  Â - a.b\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eWhy is this?\u003c\/h2\u003e\n\u003cp\u003eEvery reason plus some extrasÂ  Â  Â - a.a\u003c\/p\u003e\n\u003cp\u003ethe only reason plus some extrasÂ  Â  Â - a.b\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch2\u003eWho is this?\u003c\/h2\u003e\n\u003cp\u003ealex bradyÂ  Â  Â - a.a\u003c\/p\u003e\n\u003cp\u003ealex bradyÂ  Â  Â - a.b\u003c\/p\u003e\n\u003chr\u003e\n\u003ch2\u003e\u003c\/h2\u003e\n\u003ch3\u003eWhat are the other answers?\u003c\/h3\u003e\n\u003cp\u003e- alex brady\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-05-12T14:21:00-06:00","updated_at":"2020-07-16T16:19:25-06:00","summary_html":"Select answers from select questions from the The Only Holy Quiz. What is this? When is this? Where is this?","template_suffix":null,"handle":"holy-quiz-survey-1","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384180289571","image":{"created_at":"2020-07-16T16:19:25-06:00","alt":"","width":1250,"height":1262,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_games_logo_d24d0888-2aba-4c22-a09a-86077b1e40b1.png?v=1594937965"}},{"id":384179437603,"title":"See things differently - Learn the \"I know\" Game","created_at":"2020-05-12T12:23:57-06:00","body_html":"\u003cdiv class=\"_19iAGNPVtW4H4cmtpESqQs uaJN7fdQ7gwgTpZ7jtgcz\"\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eIf you've got some free time, This is a perfectÂ game for keeping yourself and others company while learning a little more about the universe.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eThis game is great mental practice of humility, open-mindedness, an critical thinking.\u003c\/span\u003e\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan\u003eWhat \u003cem\u003edo\u003c\/em\u003e you know, really?\u003c\/span\u003e\u003c\/p\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003e\u003c\/strong\u003e\u003c\/h3\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cstrong\u003eSetup\u003c\/strong\u003e\u003c\/span\u003e\u003c\/h3\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eNumber of players needed:\u003c\/strong\u003e 1+\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eTime required:\u003c\/strong\u003e However long you want\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eMaterials needed:\u003c\/strong\u003e\u003c\/p\u003e\n\u003cul\u003e\n\u003cli\u003eCommunication\u003c\/li\u003e\n\u003cli\u003eGoogle \/ Dictionary \/ Friends\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho goes first:Â \u003c\/strong\u003eWhoever brought up This Game\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"_19iAGNPVtW4H4cmtpESqQs uaJN7fdQ7gwgTpZ7jtgcz\"\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eHow To Play\u003c\/span\u003e\u003c\/h3\u003e\n\u003col\u003e\n\u003cli\u003eThe player whose turn it is will be called the Knower. TheÂ KnowerÂ saysÂ something they know, but that the others may not know that they know.\u003c\/li\u003e\n\u003cli\u003eIf any one of the others disagrees with the known statement, that one must declare so before the turn passes.\u003c\/li\u003e\n\u003cli\u003eIf one other disagrees, that one is the Contender. If multiple others disagree, the multiple must agree on one voice, one person to be the Contender.\u003c\/li\u003e\n\u003cli\u003eThe Contender states a counter to the Knower's known statement.\u003c\/li\u003e\n\u003cli\u003eThe Knower and the Contender have 2 minutes to collect information to support their position on the thing they know.\u003c\/li\u003e\n\u003cli\u003eThe Knower and the Contender, respectively, have 1 minute toÂ elaborate theirÂ position to each other and any watchers.\u003c\/li\u003e\n\u003cli\u003eThere is no rebuttal.\u003c\/li\u003e\n\u003cli\u003eThere is a pause of 1 minute.\u003c\/li\u003e\n\u003cli\u003eThe Knower states a thing they know.\u003c\/li\u003e\n\u003cli\u003eThe turn passes.\u003c\/li\u003e\n\u003c\/ol\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3 class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eHow To Play 2\u003c\/span\u003e\u003c\/h3\u003e\n\u003cul\u003e\n\u003cli\u003eSpeak in facts or opinions or feelings\u003c\/li\u003e\n\u003cli\u003eProbe the deeper questions of the universe\u003c\/li\u003e\n\u003cli\u003eStay respectful\u003c\/li\u003e\n\u003cli\u003eExpect disagreement\u003c\/li\u003e\n\u003cli\u003eLove each other\u003c\/li\u003e\n\u003cli\u003eStay hydrated\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003ch3\u003e\u003cspan style=\"text-decoration: underline;\"\u003eHow to Play with One Person\u003c\/span\u003e\u003c\/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cspan\u003eâ˜•\u003c\/span\u003e\u003c\/li\u003e\n\u003cli\u003e\u003ca href=\"https:\/\/en.wikipedia.org\/wiki\/Main_Page\" target=\"_blank\" rel=\"noopener noreferrer\"\u003eWikipedia.org\u003c\/a\u003e\u003c\/li\u003e\n\u003c\/ul\u003e\n\u003cp\u003eÂ \u003c\/p\u003e\n\u003c\/div\u003e\n\u003c\/div\u003e\n\u003cdiv class=\"_19iAGNPVtW4H4cmtpESqQs uaJN7fdQ7gwgTpZ7jtgcz\"\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\u003c\/div\u003e\n\u003cdiv class=\"_1nAhIjgz7pfSX4_5eYD8-T _1bCd4DBKF0Osr6neFkpLF3 _3ey3bKaKuSVt2EZD-7y5ng\"\u003e\u003c\/div\u003e\n\u003c\/div\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-05-12T12:39:00-06:00","updated_at":"2020-09-30T01:12:20-06:00","summary_html":"\u003cp\u003eGot some free time? This is a perfectÂ game for keeping yourself and others company while learning a little more about the universe.\u003c\/p\u003e\n\u003cp class=\"_1q32G7u8aTwBaLUSN_06Cl\"\u003e\u003cstrong\u003eNumber of players:\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003e1+Â \u003cstrong\u003eTime required:\u003c\/strong\u003e\u003cspan\u003eÂ \u003c\/span\u003eHowever long you want\u003c\/p\u003e\n\u003cp\u003eÂ \u003c\/p\u003e","template_suffix":"","handle":"learn-the-i-know-game","tags":"game","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/384179437603","image":{"created_at":"2020-07-16T16:20:06-06:00","alt":"","width":1250,"height":1262,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/ab_games_logo_781b2602-6315-4643-9048-74db88b9770c.png?v=1594938006"}},{"id":383920537635,"title":"find peace","created_at":"2020-04-17T01:06:34-06:00","body_html":"\u003cp\u003eDo you want peace? Itâ€™s a simple question.\u003c\/p\u003e\n\u003cp\u003eTo want peace is the sane answer. An opposite of peace is turmoil. Turmoil produces stress which is mentally \u003cem\u003eand\u003c\/em\u003e physically unhealthy for the body. In addition, reveling in turmoilâ€Šâ€”â€Šdramaâ€Šâ€”â€Šincreases this stress not only in yourself, but also in others. We have the common courtesy to cover our mouths when we cough to not spread germs. Likewise we should strive do decrease the spread of stress by minimizing out speech and actions that increase stress in our environments.\u003c\/p\u003e\n\u003cp\u003eSo \u003cstrong\u003ehow\u003c\/strong\u003e do we come to peace?\u003c\/p\u003e\n\u003cp\u003eItâ€™s simple. You must forgive.\u003c\/p\u003e\n\u003ch3\u003eThe Usual\u003c\/h3\u003e\n\u003cp\u003eThis isnâ€™t necessarily the way weâ€™re used to dealing with out problems (not all of them, anyway.) The common methods used to come to peace, though, are intrinsically flawed. The effects they have on the world actually \u003cem\u003eincrease\u003c\/em\u003e turmoil, increase stress, and decrease peace.\u003c\/p\u003e\n\u003cp\u003eFor example, two common methods are retribution and holding in the stress. Retribution increases the distress of the other (who or whatever you were unhappy with), while holding onto the stress inwardly can prove \u003ca href=\"http:\/\/www.teaspoonofhappy.com\/blog\/2015\/9\/14\/where-we-hold-pain-how-toxic-emotions-get-stuck-in-the-body\"\u003etoxic\u003c\/a\u003e to the body. So while these actions may be the \u003cem\u003eeasy\u003c\/em\u003e choices to make, they are not the right actions. So what should we do to increase peace?\u003c\/p\u003e\n\u003cp\u003eItâ€™s simple. Forgive.\u003c\/p\u003e\n\u003ch3\u003eThe How\u003c\/h3\u003e\n\u003cp\u003eForgiveness is understanding deeply the following:\u003c\/p\u003e\n\u003cp\u003eâ€œI understand that this has happened and cannot be changed. For the sake of my health and the health of othersâ€Šâ€”â€Šfor the sake of creating right thought and creating right action in \u003cem\u003ethis present moment,\u003c\/em\u003e I must leave the past and my reactions to the past in the past.â€\u003c\/p\u003e\n\u003ch3\u003eExpand Definitions\u003c\/h3\u003e\n\u003cp\u003eThis mindset is not exclusive to people who may â€œwrongâ€ you. Also situations can have the effect of inducing a negative emotional state within you.\u003c\/p\u003e\n\u003cp\u003eImagine an unusually difficult work assignment has been handed to you. If you are unable to forgive the situation, you may spend your time grumbling about the assignment while doing a shoddy job at it. What has any of that negativity accomplished? Youâ€™ve wasted real time of your life being unhappy. Youâ€™ve polluted your body with stress. The work you did must now be redone by your co-workers, fostering an unhealthy workplace environment, and contributing to future stresses.\u003c\/p\u003e\n\u003ch3\u003eThe Question and the Answer\u003c\/h3\u003e\n\u003cp\u003eI ask again: Do you want peace? Then say it with me:\u003c\/p\u003e\n\u003cblockquote\u003e\u003cstrong\u003eâ€œI understand that this has happened and cannot be changed. For the sake of my health and the health of othersâ€Šâ€”â€Šfor the sake of creating right thought and right action in \u003cem\u003ethis present moment,\u003c\/em\u003e I must leave the past and my reactions to the past in the past.â€\u003c\/strong\u003e\u003c\/blockquote\u003e\n\u003cimg src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed\u0026amp;referrerSource=full_rss\u0026amp;postId=f3b92674b0eb\" width=\"1\" height=\"1\"\u003e\n\u003chr\u003e\n\u003cp\u003efind peace was originally published asÂ \u003ca href=\"https:\/\/medium.com\/right-action\/do-you-want-peace-f3b92674b0eb\"\u003eDo you want peace?\u003c\/a\u003eÂ in \u003ca href=\"https:\/\/medium.com\/right-action\"\u003eRight Action\u003c\/a\u003e on Medium, where people are continuing the conversation by highlighting and responding to this story.\u003c\/p\u003e","blog_id":50202673187,"author":"alex brady","user_id":40701493283,"published_at":"2020-04-17T01:07:00-06:00","updated_at":"2020-05-13T01:12:51-06:00","summary_html":"For the sake of my health and the health of othersâ€Šâ€”â€Šfor the sake of creating right thought and creating right action, I must leave the past \u003cem\u003eand my reactions to the past\u003c\/em\u003e in the past.","template_suffix":null,"handle":"find-peace","tags":"","admin_graphql_api_id":"gid:\/\/shopify\/OnlineStoreArticle\/383920537635","image":{"created_at":"2020-04-17T01:06:34-06:00","alt":"sun in sky black and white","width":4032,"height":3024,"src":"https:\/\/cdn.shopify.com\/s\/files\/1\/0281\/7887\/4403\/articles\/sun-in-sky-black-white.jpg?v=1587107194"}}]}